# -*- coding: utf-8 -*-

# danawa_cralwer.py
# sammy310


from ctypes import sizeof
import enum
from selenium import webdriver
from selenium.webdriver.common.by import By
from selenium.webdriver.support.ui import WebDriverWait
from selenium.webdriver.support import expected_conditions as EC

from selenium.webdriver.common.action_chains import ActionChains
from selenium.webdriver.common.keys import Keys

from scrapy.selector import Selector

from datetime import datetime
from datetime import timedelta
from pytz import timezone
import csv
import os
import os.path
import shutil
from time import sleep

from multiprocessing import Pool

from soupsieve import select


PROCESS_COUNT = 2
CRAWLING_DATA_CSV_FILE = 'DiningCode.csv'
DATA_PATH = 'crawl_data'
DATA_REFRESH_PATH = f'{DATA_PATH}/Last_Data'

TIMEZONE = 'Asia/Seoul'

CHROMEDRIVER_PATH = 'chromedriver.exe'

DATA_DIVIDER = '---'
DATA_REMARK = '//'
DATA_ROW_DIVIDER = '_'
DATA_PRODUCT_DIVIDER = '|'

STR_NAME = 'name'
STR_URL = 'url'


SI_LIST = ['서울', '강원', '경기', '경남', '경북', '광주', '대구', '대전',
           '부산', '세종', '울산', '인천', '전남', '전북', '제주', '충남', '충북']

# SI_LIST = ['서울']

GU_LIST = [
    ['강남구',  '강동구',  '강북구',  '강서구',  '관악구',  '광진구',  '구로구',  '금천구',  '노원구',  '도봉구',  '동대문구',  '동작구',  '마포구',
        '서대문구',  '서초구',  '성동구',  '성북구',  '송파구',  '양천구',  '영등포구',  '용산구',  '은평구',  '종로구',  '중구',  '중랑구'],
    ['강릉시', '고성군', '동해시', '삼척시', '속초시', '양구군', '양양군', '영월군', '원주시',
     '인제군', '정선군', '철원군', '춘천시', '태백시', '평창군', '홍천군', '화천군', '횡성군'],
    ['가평군', '고양시', '고양시 덕양구', '고양시 일산동구', '고양시 일산서구', '과천시', '광명시', '광주시', '구리시', '군포시', '김포시', '남양주시', '동두천시', '부천시', '성남시', '성남시 분당구', '성남시 수정구', '성남시 중원구', '수원시', '수원시 권선구', '수원시 영통구', '수원시 장안구', '수원시 팔달구',
     '시흥시', '안산시', '안산시 단원구', '안산시 상록구', '안성시', '안양시', '안양시 동안구', '안양시 만안구', '양주시', '양평군', '여주시', '연천군', '오산시', '용인시', '용인시 기흥구', '용인시 수지구', '용인시 처인구', '의왕시', '의정부시', '이천시', '파주시', '평택시', '포천시', '하남시', '화성시'],
     ['거제시','거창군','고성군','김해시','남해군','밀양시','사천시','산청군','양산시','의령군','진주시','창녕군','창원시','창원시 마산합포구','창원시 마산회원구','창원시 성산구','창원시 의창구','창원시 진해구','통영시','하동군','함안군','함양군','합천군'],
     ['경산시','경주시','고령군','구미시','군위군','김천시','문경시','봉화군','상주시','성주군','안동시','영덕군','영양군','영주시','영천시','예천군','울릉군','울진군','의성군','청도군','청송군','칠곡군','포항시','포항시 남구','포항시 북구'],
     ['광산구','남구','동구','북구','서구'],
     ['남구','달서구','달성군','동구','북구','서구','수성구','중구'],
     ['대덕구','동구','서구','유성구','중구'],
     ['강서구','금정구','기장군','남구','동구','동래구','부산진구','북구','사상구','사하구','서구','수영구','연제구','영도구','중구','해운대구'],
     ['가람동','고운동','금남면','나성동','다정동','대평동','도담동','반곡동','보람동','보람동','부강면','산울동','새롬동','소담동','소정면','아름동','어진동','연기면','연동면','연서면','장군면','전동면','전의면','조치원읍','종촌동','집현동','한솔동','합강동','해밀동'],
     ['남구','동구','북구','울주군','중구'],
     ['강화군','계양구','남동구','동구','미추홀구','부평구','서구','연수구','옹진군','중구'],
     ['강진군','고흥군','곡성군','광양시','구례군','나주시','담양군','목포시','무안군','보성군','순천시','신안군','여수시','영광군','영암군','완도군','장성군','장흥군','진도군','함평군','해남군','화순군'],
     ['고창군','군산시','김제시','남원시','무주군','부안군','순창군','완주군','익산시','임실군','장수군','전주시','전주시 덕진구','전주시 완산구','정읍시','진안군'],
     ['서귀포시','제주시'],
     ['계룡시','공주시','금산군','논산시','당진시','보령시','부여군','서산시','서천군','아산시','예산군','천안시','천안시 동남구','천안시 서북구','청양군','태안군','홍성군'],
     ['괴산군','단양군','보은군','영동군','옥천군','음성군','제천시','증평군','진천군','청주시','청주시 상당구','청주시 서원구','청주시 청원구','청주시 흥덕구','충주시']
]
DONG_LIST = [
    [
        ['강남역', '삼성역', '선릉역', '신사역', '가로수길', '역삼역', '압구정', '코엑스', '신논현역', '선릉', '역삼', '개포동', '논현동',
         '대치동', '도곡동', '삼성동', '세곡동', '수서동', '신사동', '압구정동', '역삼동', '율현동', '일원동', '자곡동', '청담동'],
        ['천호역', '강동역', '굽은다리역', '고덕역', '암사역', '명일역', '강일동', '고덕동',
         '길동', '둔촌동', '명일동', '상일동', '성내동', '암사동', '천호동'],
        ['수유', '미아사거리', '북한산', '미아역', '수유시장', '북서울꿈의숲', '화계역', '미아동',
         '번동', '삼각산동', '삼양동', '송중동', '송천동', '수유동', '우이동', '월곡동', '인수동'],
        ['마곡', '발산역', '마곡나루역', '화곡역', '김포공항', '마곡역', '가양역', '등촌역', '까치산역', '강서구청', '가양동',
         '개화동', '공항동', '과해동', '내발산동', '등촌동', '마곡동', '방화동', '염창동', '오곡동', '오쇠동', '외발산동', '화곡동'],
        ['사당역', '신림역', '서울대입구역', '신림', '샤로수길', '낙성대', '낙성대역', '봉천역', '서울대', '낙성대동', '난곡동', '난향동', '남현동', '대학동', '미성동', '보라매동',
         '봉천동', '삼성동', '서림동', '서원동', '성현동', '신대방동', '신림동', '신사동', '신원동', '은천동', '인헌동', '조원동', '중앙동', '청룡동', '청림동', '행운동'],
        ['건대', '군자역', '구의역', '군자', '강변역', '아차산역', '광장동', '어린이대공원',
         '아차산', '광장동', '구의동', '군자동', '능동', '자양동', '중곡동', '화양동'],
        ['신도림', '구로디지털단지', '신도림역', '구로역', '대림역', '온수역', '구일역', '가리봉동', '개봉동',
         '고척동', '구로동', '궁동', '신도림동', '신정동', '오류동', '온수동', '천왕동', '항동'],
        ['가산디지털단지', '가산', '독산역', '시흥사거리', '가산역', '가산동', '독산동', '시흥동', '조원동'],
        ['노원역', '공릉', '석계역', '공릉역', '태릉입구역', '석계', '수락산역', '하계역', '광운대',
         '공릉동', '상계10동', '상계동', '석관동', '월계동', '장위동', '중계동', '하계동'],
        ['창동', '쌍문역', '창동역', '방학역', '쌍문', '도봉산', '도봉산역',
         '방학', '도봉역', '도봉동', '방학동', '쌍문동', '창동'],
        ['회기', '청량리', '회기역', '경희대', '답십리', '청계천', '장한평', '답십리동', '면목동', '신설동',
         '용답동', '용두동', '이문동', '장안동', '전농동', '정왕동', '제기동', '청량리동', '회기동', '휘경동'],
        ['사당역', '이수역', '노량진', '노량진역', '이수', '신대방역', '남성역', '보라매역', '신대방삼거리', '숭실대',
         '남현동', '노량진동', '대방동', '동작동', '본동', '사당동', '상도동', '신대방동', '이촌동', '흑석동'],
        ['홍대', '연남동', '합정', '신촌', '합정역', '홍대입구역', '공덕역', '마포역', '망리단길', '신촌역', '마포', '공덕동', '구수동', '노고산동', '당인동', '대흥동', '도화동', '동교동', '마포동', '망원동',
         '상수동', '상암동', '서교동', '성산동', '신공덕동', '신수동', '신정동', '신촌동', '아현동', '연남동', '염리동', '용강동', '중동', '창전동', '청파동', '토정동', '하중동', '합정동', '현석동'],
        ['신촌', '연희동', '신촌역', '서대문역', '홍제역', '이대', '이대역', '충정로역', '독립문역', '홍제동', '명지대', '연세대', '남가좌동', '냉천동', '대신동', '대현동',
         '미근동', '봉원동', '북가좌동', '북아현동', '신촌동', '연희동', '영천동', '옥천동', '창천동', '천연동', '충정로', '합동', '현저동', '홍은동', '홍제동'],
        ['강남역', '사당역', '양재역', '신사역', '이수역', '교대역', '신논현역', '고속터미널', '양재', '서래마을',
         '내곡동', '반포동', '방배동', '서초동', '신원동', '양재동', '염곡동', '우면동', '원지동', '잠원동'],
        ['성수', '왕십리', '성수역', '서울숲', '왕십리역', '뚝섬역', '한양대', '장한평', '금호동', '도선동', '마장동',
         '사근동', '상왕십리동', '성수동', '송정동', '옥수동', '용답동', '응봉동', '하왕십리동', '행당동', '홍익동'],
        ['성신여대', '고려대', '한성대입구역', '안암', '정릉', '돌곶이역', '북한산', '한성대입구', '안암역', '보문역', '성신여대입구역', '길음동', '돈암동',
         '동선동', '동소문동', '보문동', '삼선동', '상월곡동', '석관동', '성북동', '안암동', '월곡동', '장위동', '정릉동', '종암동', '하월곡동'],
        ['잠실', '잠실역', '송리단길', '잠실새내', '위례', '문정역', '잠실새내역', '올림픽공원', '석촌호수', '가락시장', '가락동', '거여동',
         '마천동', '문정동', '방이동', '삼전동', '석촌동', '송파동', '신천동', '오금동', '오륜동', '잠실동', '장지동', '청량리동', '풍납동'],
        ['목동', '오목교', '목동역', '신정네거리', '신정역', '목동파라곤',
         '양천구청역', '목동현대백화점', '목동', '신월동', '신정동'],
        ['여의도', '영등포', '영등포역', '문래', '당산역', '여의도역', '타임스퀘어', '영등포구청', '당산동',
         '대림동', '도림동', '문래동', '신길동', '양평동', '양화동', '여의도동', '여의동', '영등포동'],
        ['이태원', '서울역', '용산역', '한남동', '삼각지', '해방촌', '신용산', '한강진역', '이태원역', '삼각지역', '갈월동', '남영동', '도원동', '동빙고동', '동자동', '문배동', '보광동',
         '산천동', '서계동', '서빙고동', '신계동', '신창동', '용문동', '용산동', '원효로', '이촌동', '이태원동', '주성동', '청암동', '청파동', '한강로', '한남동', '효창동', '후암동']
    ],
    [
        ['주문진', '강릉역', '경포대', '안목해변', '강릉중앙시장', '경포', '초당순두부마을', '두산동', '강동면', '강문동', '견소동', '교동', '구정면', '금학동', '난곡동', '남문동', '남항진동', '내곡동', '노암동', '담산동', '대전동', '두산동', '명주동', '박월동', '병산동', '사천면', '성남동', '성내동', '성산면', '송정동', '신석동', '안현동', '연곡면', '옥계면', '옥천동', '왕산면', '용강동', '운산동', '운정동', '월호평동', '유산동', '유천동', '임당동', '입암동', '장현동', '저동', '주문진읍', '죽헌동', '지변동', '청량동', '초당동', '포남동', '학동', '홍제동', '회산동'], ['간성읍', '거진읍', '죽왕면', '토성면', '현내면'], ['묵호', '묵호항', '동해역', '망상해수욕장', '괴란동', '구미동', '구호동', '귀운동', '나안동', '내동', '단봉동', '달방동', '대구동', '대진동', '동호동', '동회동', '만우동', '망상동', '묵호진동', '발한동', '부곡동', '북평동', '비천동', '삼화동', '송정동', '쇄운동', '신흥동', '심곡동', '어달동', '용정동', '이기동', '이도동', '이로동', '지가동', '지흥동', '천곡동', '초구동', '추암동', '평릉동', '호현동', '효가동'], ['가곡면', '갈천동', '건지동', '교동', '근덕면', '근산동', '남양동', '노곡면', '당저동', '도경동', '도계읍', '등봉동', '마달동', '마평동', '미로면', '사직동', '성남동', '성내동', '성북동', '신기면', '오분동', '오사동', '우지동', '원당동', '원덕읍', '읍상동', '읍중동', '자원동', '적노동', '정상동', '정하동', '조비동', '증산동', '평전동', '하장면'], ['대포항', '속초중앙시장', '아바이마을', '동명항', '속초시장', '속초관광수산시장',
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 '설악워터피아', '교동', '금호동', '노학동', '대포동', '도문동', '동명동', '설악동', '영랑동', '장사동', '조양동', '중앙동', '청학동', '청호동'], ['국토정중앙면', '동면', '방산면', '양구읍', '해안면'], ['하조대', '낙산사', '강현면', '서면', '손양면', '양양읍', '현남면', '현북면'], ['김삿갓면', '남면', '무릉도원면', '북면', '상동읍', '영월읍', '주천면', '중동면', '한반도면'], ['오크밸리', '문막', '원주역', '치악산', '간현역', '오크밸리리조트', '가현동', '개운동', '관설동', '귀래면', '단계동', '단구동', '명륜동', '무실동', '문막읍', '반곡동', '봉산동', '부론면', '소초면', '신림면', '우산동', '원동', '인동', '일산동', '중앙동', '지정면', '태장동', '판부면', '평원동', '학성동', '행구동', '호저면', '흥업면'], ['설악산', '미시령', '기린면', '남면', '북면', '상남면', '서화면', '인제읍'], ['하이원', '사북', '강원랜드', '고한읍', '남면', '북평면', '사북읍', '신동읍', '여량면', '임계면', '정선읍', '화암면'], ['갈말읍', '근남면', '근북면', '김화읍', '동송읍', '서면', '철원읍'], ['남춘천역', '춘천역', '남춘천', '강촌', '강원대학교', '춘천명동', '강촌역', '강원대', '청평사', '애막골', '소양강', '강원도청', '교동', '궁내동', '근화동', '낙원동', '남면', '남산면', '동내면', '동면', '동산면', '봉의동', '북산면', '사농동', '사북면', '삼천동', '서면', '석사동', '소양로', '송암동', '신동', '신동면', '신북읍', '약사동', '옥천동', '온의동', '요선동', '우두동', '운교동', '조양동', '죽림동', '중도동', '중앙로', '칠전동', '퇴계동', '효자동', '후평동'],
        ['금천동', '동점동', '문곡동', '백산동', '상사미동', '상장동', '소도동', '원동', '장성동', '적각동', '조탄동', '창죽동', '철암동', '통동', '하사미동', '혈동', '화전동', '황지동'], ['대관령', '봉평', '오대산', '용평리조트', '진부', '대관령면', '대화면', '미탄면', '방림면', '봉평면', '용평면', '진부면', '평창읍'], ['비발디파크', '오션월드', '남면', '내면', '내촌면', '두촌면', '북방면', '서면', '서석면', '영귀미면', '홍천읍', '화촌면'], ['간동면', '사내면', '상서면', '하남면', '화천읍'], ['둔내', '안흥', '갑천면', '강림면', '공근면', '둔내면', '서원면', '안흥면', '우천면', '청일면', '횡성읍']],
    [
        ['청평', '가평역', '청평역', '대성리역', '상천역', '가평읍', '북면', '상면', '설악면', '조종면', '청평면'],
        ['덕양구', '일산동구', '일산서구'],
        ['행주산성', '서오릉', '화정', '삼송역', '화정역', '원당', '삼송', '원흥역', '행신역', '행신', '강매동', '고양동', '관산동', '내곡동', '내유동', '대자동', '대장동', '덕은동', '도내동', '동산동', '벽제동',
         '북한동', '삼송동', '선유동', '성사동', '신원동', '신평동', '오금동', '용두동', '원당동', '원흥동', '주교동', '지축동', '토당동', '행신동', '행주내동', '행주외동', '향동동', '현천동', '화전동', '화정동', '효자동'],
        ['라페스타', '백석역', '정발산역', '웨스턴돔', '마두역', '애니골', '정발산', '백석', '일산호수공원', '마두동', '문봉동',
         '백석동', '사리현동', '산황동', '설문동', '성석동', '식사동', '장항동', '정발산동', '중산동', '지영동', '풍동'],
        ['킨텍스', '대화역', '주엽역', '일산역', '원마운트', '탄현', '일산시장', '주엽', '대화', '탄현역',
         '가좌동', '구산동', '대화동', '덕이동', '법곳동', '일산동', '장항동', '정발산동', '주엽동', '탄현동'],
        ['청계산', '과천역', '선바위역', '서울대공원', '정부과천청사역', '대공원역', '관악산', '경마공원', '서울랜드',
         '갈현동', '과천동', '관문동', '막계동', '문원동', '별양동', '부림동', '원문동', '주암동', '중앙동'],
        ['광명역', '밤일마을', '철산역', '광명사거리', '철산', '광명시장', '하안사거리', '소하',
         '가학동', '광명동', '노온사동', '소하동', '옥길동', '일직동', '철산동', '필동', '하안동'],
        ['곤지암', '퇴촌', '화담숲', '오포', '태재고개', '경안동', '곤지암읍', '광남동', '남종면', '남한산성면', '도척면', '목동', '목현동',
         '삼동', '송정동', '쌍령동', '역동', '오포읍', '장지동', '중대동', '직동', '초월읍', '탄벌동', '태전동', '퇴촌면', '회덕동'],
        ['구리역', '갈매역', '돌다리', '구리시장', '갈매동', '공릉동',
         '교문동', '사노동', '수택동', '아천동', '인창동', '토평동'],
        ['산본', '금정역', '산본역', '반월호수', '당정역', '반월저수지', '대야미', '군포역', '한세대', '산본시장', '수리산역', '광정동',
         '궁내동', '금정동', '당동', '당정동', '대야미동', '도마교동', '둔대동', '부곡동', '산본동', '속달동', '수리동', '재궁동'],
        ['고촌', '김포구래', '김포고촌', '한강신도시', '감정동', '걸포동', '고촌읍', '구래동', '대곶면',
         '마산동', '북변동', '사우동', '양촌읍', '운양동', '월곶면', '장기동', '통진읍', '풍무동', '하성면'],
        ['별내', '팔당', '진접', '양수리', '퇴계원', '오남', '도농역', '팔당댐', '미음나루', '금곡동', '다산동', '도농동', '별내동', '별내면', '삼패동',
         '수동면', '수석동', '수택동', '오남읍', '와부읍', '이패동', '일패동', '조안면', '지금동', '진건읍', '진접읍', '퇴계원읍', '평내동', '호평동', '화도읍'],
        ['지행역', '지행', '소요산', '동두천역', '동두천중앙역', '걸산동', '광암동', '동두천동', '보산동',
         '상봉암동', '상패동', '생연동', '송내동', '안흥동', '중앙동', '지행동', '탑동동', '하봉암동'],
        ['부천역', '신중동역', '상동역', '송내역', '역곡', '부천시청', '부천시청역', '소사역', '계수동', '고강동', '괴안동', '내동', '대장동', '도당동', '범박동',
         '삼정동', '상동', '소사동', '송내동', '심곡동', '약대동', '여월동', '역곡동', '오정동', '옥길동', '원미동', '원종동', '작동', '중동', '춘의동'],
        ['분당구', '수정구', '중원구'],
        ['판교', '서현역', '정자역', '판교역', '미금역', '야탑', '서현', '수내역', '오리역', '구미동', '궁내동', '금곡동', '대장동', '동원동',
         '백현동', '분당동', '삼평동', '서현동', '석운동', '수내동', '야탑동', '운중동', '율동', '이매동', '정자동', '판교동', '하산운동'],
        ['위례', '태평역', '단대오거리', '신흥역', '가천대', '단대오거리역', '수진역', '청계산옛골', '남한산성입구역', '고등동', '금광동', '금토동', '단대동', '둔전동',
         '복정동', '사송동', '산성동', '상적동', '수진동', '시흥동', '신촌동', '신흥동', '심곡동', '양지동', '오야동', '위례동', '중앙동', '창곡동', '태평동'],
        ['모란역', '단대오거리', '성남시청', '신구대', '수진역', '모란시장', '상대원', '성남모란', '갈현동', '금광동', '도촌동',
         '상대원동', '성남동', '야탑동', '여수동', '은행동', '중앙동', '하대원동'], ['권선구', '영통구', '장안구', '팔달구'],
        ['호매실', '곡반정동', '세류역', '수원터미널', '수원탑동', '고색동', '곡반정동', '구운동', '권선동', '금곡동', '당수동', '대황교동', '서둔동', '세류동', '오목천동', '입북동', '장지동', '진안동', '탑동', '평동',
         '평리동', '호매실동'], ['광교', '영통역', '영통', '망포역', '망포', '아주대', '광교중앙역', '영통구청', '광교호수공원', '곡선동', '광교동', '망포동', '매탄동', '신동', '영통동', '우만동', '원천동', '이의동', '하동'],
        ['성균관대역', '율전동', '수원 화성', '광교산', '성균관대', '수원북문', '수원성대', '만석공원', '상광교동',
         '송죽동', '연무동', '영화동', '율전동', '이목동', '정자동', '조원동', '천천동', '파장동', '하광교동'],
        ['수원역', '인계동', '수원시청역', '화성행궁', '화서역', '광교산', '나혜석거리', '팔달문', '지동시장', '수원남문', '매산로', '고등동', '광교동', '교동', '구천동',
         '남수동', '남창동', '매교동', '매산로', '매향동', '북수동', '세류동', '신풍동', '영동', '우만동', '인계동', '장안동', '중동', '지동', '팔달로', '화서동'],
        ['오이도', '배곧', '정왕동', '물왕저수지', '정왕역', '월곶', '정왕', '오이도역', '물왕', '은행사거리', '시화', '물왕리', '거모동', '계수동', '과림동', '광명동', '광석동', '군자동', '금이동', '논곡동', '능곡동', '대야동', '도창동',
         '매화동', '목감동', '무지내동', '물왕동', '미산동', '방산동', '배곧동', '산현동', '신천동', '안현동', '월곶동', '은행동', '장곡동', '장현동', '정왕동', '조남동', '죽율동', '포동', '하상동', '하중동', '학온동', '화정동'],
        ['단원구', '상록구'],
        ['대부도', '중앙역', '고잔역', '안산중앙역', '안산역', '고잔', '안산시청', '고잔신도시', '공단역', '고잔동', '대부남동', '대부동동', '대부북동',
         '목내동', '백운동', '선감동', '선부동', '성곡동', '신길동', '와동', '원곡동', '원시동', '정왕동', '중앙동', '초지동', '풍도동', '호수동', '화정동'],
        ['상록수역', '한대앞역', '댕이골', '반월역', '안산한양대', '건건동', '본오동', '부곡동', '사동', '사사동', '사이동', '성포동', '수암동', '양상동', '월피동', '이동', '일동', '장상동', '장하동', '팔곡이동', '팔곡일동', '해양동'], ['일죽', '공도', '원곡면', '안성베네스트', '한경대', '가사동', '가현동', '계동', '고삼면', '공도읍', '구포동', '금광면', '금산동', '금석동', '낙원동', '당왕동', '대덕면', '대천동', '도기동', '동본동', '명륜동', '미양면', '발화동', '보개면', '봉남동', '봉산동', '사곡동', '삼죽면', '서운면', '서인동', '석정동', '성남동', '숭인동', '신건지동', '신모산동', '신소현동', '신흥동', '아양동', '양성면', '연지동', '영동', '옥산동', '옥천동', '원곡면', '인지동', '일죽면', '죽산면', '중리동', '창전동', '현수동'], ['동안구', '만안구'], ['범계역', '인덕원', '평촌역', '평촌', '동편마을', '인덕원역', '평촌학원가', '수촌마을', '평촌먹자골목', '갈산동', '관양동', '귀인동', '달안동', '범계동', '부림동', '부흥동', '비산동', '석수동', '신촌동', '평안동', '평촌동', '호계동'], ['안양역', '안양일번가', '명학역', '삼막사', '안양유원지', '안양예술공원', '안양중앙시장', '석수역', '관악역', '관악산', '성결대', '박달동', '비산동', '석수동', '송정동', '안양동', '호계동'], ['장흥', '송추', ' 덕정역', '고읍', '양주역', '덕계역', '고암동', '고읍동', '광사동', '광적면', '남면', '남방동', '덕계동', '덕정동', '마전동', '만송동', '백석읍', '봉양동', '산북동', '삼숭동', '어둔동', '옥정동', '유양동', '율정동', '은현면', '장흥면', '회암동', '회정동'], ['두물머리', '양수리', '양평역', '용문역', '용문', ' 강상면', '강하면', '개군면', '단월면', '서종면', '양동면', '양서면', '양평읍', '옥천면', '용문면', '지평면', '청운면'], ['여주아울렛', '가남읍', '가업동', '강천면', '교동', '금사면', '능서면', '능현동', '단현동', '대신면', '매룡동', '멱곡동', '북내면', '산북면', '삼교동', '상거동', '상동', '신진동', '연라동', '연양동', '오금동', '오학동', '우만동', '월송동', '점동면', '점봉동', '창동', '천송동', '하거동', '하동', '현암동', '홍문동', '흥천면'], ['전곡', '군남면', '미산면', '백학면', '신서면', '연천읍', '왕징면', '장남면', '전곡읍', '중면', '청산면'], ['오산역', '오산대역', '서동탄역', '한신대', '세마역', '가수동', '가장동', '갈곶동', '고현동', '궐동', '금암동', '내삼미동', '누읍동', '두곡동', '벌음동', '부산동', '서동', '서랑동', '세교동', '수청동', '양산동', '오산동', '외삼미동', '원동', '은계동', '지곶동', '청학동', '청호동', '탑동'], ['기흥구', '수지구', '처인구'], ['보정', '동백', '기흥역', '기흥구청', '흥덕', '구성역', '보정동카페거리', '신갈', '한국민속촌', '용인동백', '고매동', '공세동', '구갈동', '농서동', '동백동', '마북동', '보라동', '보정동', '상갈동', '상하동', '서천동', '신갈동', '언남동', '영덕동', '중동', '지곡동', '청덕동', '하갈동'], ['고기리', '죽전', '죽전역', '상현역', '단국대', '데이파크', '풍덕천', '죽전카페거리', '고기동', '구미동', '동천동', '상현동', '성복동', '신봉동', '죽전동', '풍덕천동'], ['에버랜드', '명지대', '와우정사', '양지', '용인시청', '용인중앙시장', '한택식물원', '용인역북', '캐리비안베이', '고림동', '김량장동', '남동', '남사읍', '마평동', '모현읍', '백암면', '삼가동', '양지면', '역북동', '운학동', '원삼면', '유방동', '이동읍', '포곡읍', '해곡동', '호동'], ['백운호수', '청계산', '의왕역', '계원예대', '청계산입구', '청계사',
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      '모락산', '철도박물관', '고천동', '내손동', '삼동', '오전동', '왕곡동', '월암동', '이동', '청계동', '초평동', '포일동', '학의동'], ['의정부역', '회룡역', '녹양역', '가능역', '망월사역', '장암역', '가능동', '고산동', '금오동', '낙양동', '녹양동', '민락동', '산곡동', '송산동', '신곡동', '용현동', '의정부동', '자일동', '장암동', '호원동'], ['장호원', '갈산동', '고담동', '관고동', '단월동', '대월면', '대포동', '마장면', '모가면', '백사면', '부발읍', '사음동', '설성면', '송정동', '신둔면', '안흥동', '율면', '율현동', '장록동', '장호원읍', '중리동', '증일동', '증포동', '진리동', '창전동', '호법면'], ['운정', '금촌', '헤이리', '문산', '심학산', '운정역', '교하', '광탄', '출판단지', '금촌역', '검산동', '광탄면', '교하동', '군내면', '금릉동', '금촌동', '다율동', '당하동', '동패동', '맥금동', '목동동', '문발동', '문산읍', '법원읍', '산남동', '상지석동', '서패동', '송촌동', '신촌동', '아동동', '야당동', '야동동', '연다산동', '오도동', '와동동', '운정동', '월롱면', '장단면', '적성면', '조리읍', '진동면', '진서면', '탄현면', '파주읍', '파평면', '하지석동'], ['평택역', '안중', '서정리역', '송탄역', '포승', '청북', '통복시장', '지제역', '가재동', '고덕면', '군문동', '도일동', '독곡동', '동삭동', '모곡동', '비전동', '서정동', '서탄면', '세교동', '소사동', '신대동', '신장동', '안중읍', '오성면', '용이동', '월곡동', '유천동', '이충동', '장당동', '장안동', '죽백동', '지산동', '지제동', '진위면', '청룡동', '청북읍', '칠괴동', '칠원동', '통복동', '팽성읍', '평택동', '포승읍', '합정동', '현덕면'], ['베어스타운', '포천이동', '대진대', '포천일동', '가산면', '관인면', '군내면', '내촌면', '동교동', '선단동', '설운동', '소흘읍', '신북면', '신읍동', '어룡동', '영북면', '영중면', '이동면', '일동면', '자작동', '창수면', '화현면'], ['평택역', '안중', '서정리역', '송탄역', '포승', '청북', '통복시장', '지제역', '가재동', '고덕면', '군문동', '도일동', '독곡동', '동삭동', '모곡동', '비전동', '서정동', '서탄면', '세교동', '소사동', '신대동', '신장동', '안중읍', '오성면', '용이동', '월곡동', '유천동', '이충동', '장당동', '장안동', '죽백동', '지산동', '지제동', '진위면', '청룡동', '청북읍', '칠괴동', '칠원동', '통복동', '팽성읍', '평택동', '포승읍', '합정동', '현덕면'], ['베어스타운', '포천이동', '대진대', '포천일동', '가산면', '관인면', '군내면', '내촌면', '동교동', '선단동', '설운동', '소흘읍', '신북면', '신읍동', '어룡동', '영북면', '영중면', '이동면', '일동면', '자작동', '창수면', '화현면'], ['위례', '미사리', '하남미사', '스타필드', '검단산', '감북동', '감이동', '감일동', '광암동', '교산동', '길음동', '덕풍동', '망월동', '미사동', '배알미동', '상사창동', '상산곡동', '선동', '신장동', '창우동', '천현동', '초이동', '초일동', '춘궁동', '풍산동', '하사창동', '하산곡동', '학암동', '항동'], ['동탄', '향남', '병점', '병점역', '융건릉', '팔탄면', '남양', '은행사거리', '발안', '신영통', '곡선동', '금곡동', '기산동', '기안동', '남양읍', '능동', '동탄동', '마도면', '매송면', '목동', '반송동', '반월동', '반정동', '방교동', '배양동', '병점동', '봉담읍', '비봉면', '산척동', '새솔동', '서신면', '석우동', '송동', '송산동', '송산면', '신동', '안녕동', '양감면', '영천동', '오산동', '우정읍', '장안면', '장지동', '정남면', '중동', '진안동', '청계동', '팔탄면', '향남읍', '황계동']
    ],
    [['옥포', '고현', '장승포', '거제면', '고현동', '남부면', '능포동', '덕포동', '동부면', '두모동', '둔덕면', '문동동', '사등면', '삼거동', '상동동', '수월동', '아양동', '아주동', '양정동', '연초면', '옥포동', '일운면', '장목면', '장승포동', '장평동', '하청면'], ['가북면', '가조면', '거창읍', '고제면', '남상면', '남하면', '마리면', '북상면', '신원면', '웅양면', '위천면', '주상면'], ['개천면', '거류면', '고성읍', '구만면', '대가면', '동해면', '마암면', '삼산면', '상리면', '영오면', '영현면', '하이면', '하일면', '회화면'], ['장유', '진영', '인제대', '내외동', '부원역', '김해삼계', '장유율하', '김해장유', '강동', '관동동', '구산동', '내덕동', '내동', '대동면', '대성동', '대청동', '동상동', '명법동', '무계동', '봉황동', '부곡동', '부원동', '불암동', '삼계동', '삼문동', '삼방동', '삼정동', '상동면', '생림면', '서상동', '수가동', '신문동', '안동', '어방동', '외동', '유하동', '율하동', '응달동', '이동', '장유동', '전하동', '주촌면', '지내동', '진례면', '진영읍', '풍유동', '한림면', '화목동', '흥동'], ['독일마을', '고현면', '남면', '남해읍', '미조면', '삼동면', '상주면', '서면', '설천면', '이동면', '창선면'], ['밀양역', '표충사', '가곡동', '교동', '남포동', '내이동', '내일동', '단장면', '무안면', '부북면', '산내면', '산외면', '삼랑진읍', '삼문동', '상남면', '상동면', '용평동', '청도면', '초동면', '하남읍', '활성동'], ['삼천포항', '곤명면', '곤양면', '궁지동', '노룡동', '늑도동', '대방동', '대포동', '동금동', '동동', '동림동', '마도동', '백천동', '벌리동', '봉남동', '사남면', '사등동', '사천읍', '서금동', '서동', '서포면', '선구동', '송포동', '신벽동', '신수동', '실안동', '와룡동', '용강동', '용현면', '이금동', '이홀동', '정동면', '좌룡동', '죽림동', '축동면', '향촌동'], ['금서면', '단성면', '산청읍', '삼장면', '생비량면', '생초면', '시천면', '신등면', '신안면', '오부면', '차황면'], ['물금', '덕계', '양산역', '내원사', '호포역', '교동', '남부동', '다방동', '덕계동', '동면', '매곡동', '명곡동', '명동', '물금읍', '북부동', '북정동', '산막동', '삼호동', '상북면', '소주동', '신기동', '어곡동', '용당동', '원동면', '유산동', '주남동', '주진동', '중부동', '평산동', '하북면', '호계동'], ['칠곡', '가례면', '궁류면', '낙서면', '대의면', '봉수면', '부림면', '용덕면', '유곡면', '의령읍', '정곡면', '지정면', '칠곡면', '화정면'], ['경상대', '진주역', '진주시청', '가좌동', '강남동', '계동', '귀곡동', '금곡면', '금산면', '남성동', '내동면', '대곡면', '대안동', '대평면', '동성동', '망경동', '명석면', '문산읍', '미천면', '본성동', '봉곡동', '봉래동', '사봉면', '상대동', '상봉동', '상봉동동', '상봉서동', '상평동', '수곡면', '수정동', '신안동', '옥봉동', '유곡동', '이반성면', '이현동', '인사동', '일반성면', '장대동', '장재동', '정촌면', '주약동', '중안동', '지수면', '진성면', '집현면', '초전동', '충무공동', '칠암동', '판문동', '평거동', '평안동', '하대동', '하촌동', '호탄동'], ['부곡', '계성면', '고암면', '길곡면', '남지읍', '대지면', '대합면', '도천면', '부곡면', '성산면', '영산면', '유어면', '이방면', '장마면', '창녕읍'], ['마산합포구', '마산회원구', '성산구', '의창구', '진해구'], ['상남동', '경남대', '마산산호동', '마산어시장', '댓거리', '가포동', '교방동', '교원동', '구산면', '남성동', '노산동', '대내동', '대성동', '대외동', '대창동', '덕동동', '동성동', '두월동', '문화동', '반월동', '부림동', '산호동', '상남동', '서성동', '성호동', '수성동', '신월동', '신창동', '신포동', '신흥동', '예곡동', '오동동', '완월동', '우산동', '월남동', '월영동', '월포동', '유록동', '자산동', '장군동', '중성동', '중앙동', '진동면', '진북면', '진전면', '창동', '창포동', '청계동', '추산동', '평화동', '해운동', '현동', '홍문동', '화영동'], ['합성동', '마산역', '구암동', '내서읍', '두척동', '봉암동', '석전동', '양덕동', '팔룡동', '합성동', '회성동', '회원동'], ['상남동', '창원가로수길', '시티세븐', '창원대방동', '창원시티세븐', '창원중앙동', '가음정', '창원용호동', '상남시장', '반송시장', '가음동', '가음정동', '귀곡동', '귀산동', '귀현동', '남산동', '남양동', '남지동', '내동', '대방동', '대원동', '두대동', '반림동', '반송동', '반지동', '불모산동', '사파동', '사파정동', '삼동동', '삼정자동', '상남동', '상복동', '성산동', '성주동', '신월동', '신촌동', '안민동', '양곡동', '완암동', '외동', '용지동', '용호동', '웅남동', '적현동', '중앙동', '창곡동', '천선동', '토월동', '퇴촌동', '팔룡동'], ['창원대', '경남도청', '창원역', '창원사림동', '주남저수지', '내리동', '대산면', '덕정동', '도계동', '동읍', '동정동', '명곡동', '명서동', '반계동', '봉곡동', '봉림동', '북동', '북면', '사림동', '사화동', '서곡동', '서상동', '소계동', '소답동', '용동', '중동', '차용동', '퇴촌동', '팔용동'], ['용원', '진해용원', '진해역', '가주동', '경화동', '광화동', '근화동', '남문동', '남빈동', '남양동', '대영동', '대장동', '대죽동', '대천동', '대흥동', '덕산동', '도만동', '도천동', '동상동', '두동', '마천동', '명동', '무송동', '부흥동', '북부동', '서중동', '석동', '성내동', '소사동', '속천동', '송죽동', '송학동', '수도동', '수송동', '숭인동', '신흥동', '안곡동', '안골동', '여좌동', '연도동', '용원동', '원포동', '이동', '익선동', '인사동', '인의동', '자은동', '장천동', '제덕동', '제황산동', '죽곡동', '중앙동', '중평동', '창선동', '청안동', '충무동', '충의동', '태백동', '태평동', '통신동', '평안동', '풍호동', '행암동', '현동', '화천동', '회현동'], ['욕지도', '사량도', '동피랑마을', '광도면', '당동', '도남동', '도산면', '도천동', '동호동', '명정동', '무전동', '문화동', '미수동', '봉평동', '북신동', '사량면', '산양읍', '서호동', '욕지면', '용남면', '인평동', '정량동', '중앙동', '태평동', '평림동', '한산면', '항남동'], ['화개장터', '고전면', '금남면', '금성면', '북천면', '악양면', '양보면', '옥종면', '적량면', '진교면', '청암면', '하동읍', '화개면', '횡천면'], ['가야읍', '군북면', '대산면', '법수면', '산인면', '여항면', '칠북면', '칠서면', '칠원읍', '함안면'], ['마천면', '백전면', '병곡면', '서상면', '서하면', '수동면', '안의면', '유림면', '지곡면', '함양읍', '휴천면'], ['가야면', '가회면', '대병면', '대양면', '덕곡면', '묘산면', '봉산면', '삼가면', '쌍백면', '쌍책면', '야로면', '용주면', '율곡면', '적중면', '청덕면', '초계면', '합천읍']],
[['하양', '영남대', '진량', '영대', '갑제동', '계양동', '남방동', '남산면', '남천면', '내동', '대동', '대정동', '대평동', '백천동', '사동', '사정동', '삼남동', '삼북동', '삼풍동', '상방동', '서상동', '신교동', '신천동', '압량면', '압량읍', '여천동', '옥곡동', '옥산동', '와촌면', '용성면', '유곡동', '임당동', 
'자인면', '점촌동', '정평동', '조영동', '중방동', '중산동', '진량읍', '평산동', '하양읍'], ['황리단길', '불국사', '보문단지', '감포', '첨성대', '경주월드', '경주역', '석굴암', '감포읍', '강동면', '건천읍', '광명동', '교동', '구정동', '구황동', '남산동', '내남면', '노동동', '노서동', '다운동', '덕동', '도지동', '동방동', '동부동', '동천동', '마동', '문무대왕면', '배동', '배반동', '보문동', '북군동', '북부동', '사정동', '산내면', '서면', '서부동', '서악동', '석장동', '성건동', '성동동', '손곡동', '시동', '시래동', '신평동', '안강읍', '암곡동', '양남면', '외동읍', '용강동', '율동', '인왕동', '조양동', '진현동', '천군동', '천북면', '충효동', '탑동', '평동', '하동', '현곡면', '황남동', '황성동', '황오동', '황용동', '효현동'], ['개진면', '다산면', '대가야읍', '덕곡면', '성산면', '쌍림면', '우곡면', '운수면'], ['옥계', '구미역', '구미봉곡동', '금오산', '금리단길', '거의동', '고아읍', '공단동', '광평동', '구평동', '구포동', '금전동', '남통동', '도개면', '도량동', '무을면', '봉곡동', '부곡동', '비산동', '사곡동', '산동읍', '상모동', '선기동', '선산읍', '송정동', '수점동', '시미동', '신동', '신평동', '양호동', '오태동', '옥계동', '옥성면', '원평동', '인의동', '임수동', '임은동', '장천면', '지산동', '진평동', '해평면', '형곡동', '황상동'], ['군위읍', '부계면', '산성면', '삼국유사면', '소보면', '우보면', '의흥면', '효령면'], ['김천구미역', '김천역', '감문면', '감천면', '감호동', '개령면', '교동', '구성면', '남면', '남산동', '농소면', '다수동', '대광동', '대덕면', '대항면', '덕곡동', '모암동', '문당동', '백옥동', '봉산면', '부곡동', '부항면', '삼락동', '성내동', '신음동', '아포읍', '양천동', '어모면', '용두동', '율곡동', '응명동', '조마면', '증산면', '지례면', '지좌동', '평화동', '황금동'], ['점촌', '문경새재', '가은읍', '공평동', '농암면', '동로면', '마성면', '모전동', '문경읍', '불정동', '산북면', '산양면', '신기동', '영순면', '영신동', '우지동', '유곡동', '윤직동', '점촌동', '창동', '호계면', '흥덕동'], ['양원역', '명호면', '물야면', '법전면', '봉성면', '봉화읍', '상운면', '석포면', '소천면', '재산면', '춘양면'], ['한밭대', '가장동', '개운동', '거동동', '계산동', '공검면', '공성면', '낙동면', '낙상동', '낙양동', '남성동', '남장동', '남적동', '내서면', '냉림동', '도남동', '만산동', '모동면', '모서면', '무양동', '병성동', '복룡동', '부원동', '사벌국면', '서곡동', '서문동', '서성동', '성동동', '성하동', '신봉동', '양촌동', '연원동', '오대동', '외남면', '외답동', '외서면', '은척면', '이안면', '인봉동', '인평동', '죽전동', '중덕동', '중동면', '지천동', '청리면', '초산동', '함창읍', '헌신동', '화개동', '화남면', '화동면', '화북면', '화산동', '화서면', '흥각동'], ['가천면', '금수면', '대가면', '벽진면', '선남면', '성주읍', '수륜면', '용암면', '월항면', '초전면'], ['안동구시장', '안동역', '계림동', '광석동', '금곡동', '길안면', '남문동', '남부동', '남선면', '남후면', '노하동', '녹전면', '당북동', '대석동', '도량동', '도산면', '동문동', '동부동', '두호동', '명륜동', '목성동', '법상동', '법흥동', '북문동', '북후면', '삼산동', '상아동', '서부동', '서후면', '석동동', '선도동', '선주원남동', '성곡동', '송천동', '송현동', '수상동', '수하동', '신세동', '신안동', '안기동', '안막동', '안흥동', '영주동', '예안면', '옥동', '옥야동', '옥정동', '와룡면', '용상동', '운안동', '운흥동', '월성동', '율곡동', '율세동', '이천동', '일직면', '임동면', '임하면', '점촌동', '정상동', '정하동', '천리동', '태화동', '평화동', '풍산읍', '풍천면', '하망동', '형곡동', '화성동'], ['안동구시장', '안동역', '계림동', '광석동', '금곡동', '길안면', '남문동', '남부동', '남선면', '남후면', '노하동', '녹전면', '당북동', '대석동', '도량동', '도산면', '동문동', '동부동', '두호동', '명륜동', '목성동', '법상동', '법흥동', '북문동', '북후면', '삼산동', '상아동', '서부동', '서후면', '석동동', '선도동', '선주원남동', '성곡동', '송천동', '송현동', '수상동', '수하동', '신세동', '신안동', '안기동', '안막동', '안흥동', '영주동', '예안면', '옥동', '옥야동', '옥정동', '와룡면', '용상동', '운안동', '운흥동', '월성동', '율곡동', '율세동', '이천동', '일직면', '임동면', '임하면', '점촌동', '정상동', '정하동', '천리동', '태화동', '평화동', '풍산읍', '풍천면', '하망동', '형곡동', '화성동'], ['석보면', '수비면', '영양읍', '일월면', '입암면', '청기면'], ['풍기', '소백산', '영주역', '가흥동', '고현동', '단산면', '문수면', '문정동', '봉현면', '부석면', '상망동', '상줄동', '순흥면', '아지동', '안정면', '영주동', '이산면', '장수면', '적서동', '조암동', '조와동', '창진동', '평은면', '풍기읍', '하망동', '휴천동'], ['영천역', '고경면', '과전동', '괴연동', '교촌동', '금노동', '금호읍', '녹전동', '대전동', '대창면', '도남동', '도동', '도림동', '망정동', '매산동', '문내동', '문외동', '범어동', '본촌동', '봉동', '북안면', '서산동', '성내동', '신기동', '신녕면', '쌍계동', '야사동', '언하동', '오미동', '오수동', '완산동', '임고면', '자양면', '작산동', '조교동', '창구동', '채신동', '청통면', '화남면', '화룡동', '화북면', '화산면'], ['감천면', '개포면', '보문면', '예천읍', '용궁면', '용문면', '유천면', '은풍면', '지보면', '풍양면', '호명면', '효자면'], ['북면', '서면', '울릉읍'], ['후포리', '후포항', '근남면', '금강송면', '기성면', '매화면', '북면', '온정면', '울진읍', '죽변면', '평해읍', '후포면'], ['가음면', '구천면', '금성면', '다인면', '단밀면', '단북면', '단촌면', '봉양면', '비안면', '사곡면', '신평면', '안계면', '안사면', '안평면', '옥산면', '의성읍', '점곡면', '춘산면'], ['각남면', '각북면', '금천면', '매전면', '운문면', '이서면', '청도읍', '풍각면', '화양읍'], ['부남면', '안덕면', '주왕산면', '진보면', '청송읍', '파천면', '현동면', '현서면'], ['팔공산', '석적', '가산면', '기산면', '동명면', '북삼읍', '석적읍', '약목면', '왜관읍', '지천면'], ['남구', '북구'], 
['구룡포', '동촌', '포항공대', '포스텍', '괴동동', '구룡포읍', '대도동', '대송면', '대잠동', '동촌동', '동해면', '상도동', '송내동', '송도동', '연일읍', '오천읍', '이동', '인덕동', '일월동', '장기면', '장흥동', '죽도동', '지곡동', '청림동', '해도동', '호동', '호미곶면', '효자동'], ['영일대', '죽도시장', '포항역', '영일대해수욕장', '용연사', '북부해수욕장', '포항죽도시장', '기계면', '기북면', '남빈동', '대신동', '대흥동', '덕산동', '덕수동', '동빈', '두호동', '득량동', '상대동', '상원동', '송라면', '신광면', '신흥동', '양덕동', '여남동', '여천동', '용흥동', '우현동', '장성동', '죽도동', '죽장면', '중앙동', '창포동', '청하면', '학산동', '학잠동', '항구동', '환호동', '흥해읍']],
[['수완지구', '광주송정역', '신창', '선운지구', '광주송정', '광주공항', '광주첨단', '고룡동', '광산동', '남산동', '내산동', '대산동', '덕림동', '도덕동', '도산동', '도천동', '도호동', '동림동', '동산동', '동호동', '두정동', '등임동', '명도동', '명화동', '박호동', '복룡동', '본덕동', '북산동', '비아동', '사호동', '산막동', '산수동', '산월동', '산정동', '삼거동', '삼도동', '서봉동', '선동', '선암동', '소촌동', '송대동', '송산동', '송정동', '송촌동', '송치동', '송학동', '수완동', '신가동', '신동', '신룡동', '신창동', '신촌동', '쌍암동', '안청동', '양동', '양산동', '연산동', '오산동', '오선동', '오운동', '옥동', '왕동', '요기동', '용곡동', '용동', '용봉동', '우산동', '운남동', '운수동', '월계동', '월곡동', '월전동', '유계동', '임곡동', '장덕동', '장록동', '장수동', '지산동', '지정동', '지죽동', '지평동', '진곡동', '하남동', '하산동', '황룡동', '흑석동'], ['돌고개역', '무등시장', '구동', '구소동', '노대동', '대지동', '덕남동', '도금동', '방림동', '백운동', '봉선동', '사동', '서동', '석정동', '송하동', '승촌동', '신장동', '압촌동', '양과동', '양림동', '양촌동', '원산동', '월산동', '월성동', '이장동', '임암동', '주월동', '지석동', '진월동', '칠석동', '풍암동', '행암동', '화장동'], ['충장로', '금남로', '조선대', '무등산', '조대후문', '금남로4가역', '남광주역', '증심사', '계림동', '광산동', '궁동', '금남로', '금동', '남동', '내남동', '대의동', '대인동', '동명동', '방림동', '불로동', '산수동', '서석동', '석곡동', '선교동', '소태동', '수기동', '용산동', '용연동', '우산동', '운림동', '월남동', '장동', '중흥동', '지산동', '충장로', '풍향동', '학동', '호남동', '황금동'], ['양산', '첨단', '전남대', '전대후문', '광주역', '각화동', '광천동', '금곡동', '누문동', '대촌동', '덕의동', '동림동', '두암동', '망월동', '매곡동', '문흥동', '본촌동', '북동', '산수동', '삼각동', '생용동', '수곡동', '신안동', '신용동', '양산동', '연제동', '오룡동', '오치동', '용강동', '용두동', '용봉동', '용전동', '우산동', '운암동', '운정동', '월출동', '유동', '일곡동', '임동', '장등동', '중흥동', '지야동', '청풍동', '충효동', '태령동', '풍향동', '화암동', '효령동'], ['상무지구', '상무', '금호동', '유스퀘어', '광천터미널', '광주시청', '운천역', '상무역', '광주상무지구', '광천동', '금호동', '내방동', '농성동', '덕흥동', '동림동', '동천동', '마륵동', '매월동', '벽진동', '서창동', '세하동', '쌍촌동', '양동', '용두동', '운암동', '유촌동', '치평동', '풍암동', '화정동']],
[['궁동', '앞산', '안지랑', '계명대', '영대병원', '서부정류장', '봉리단길', '대구앞산', '현충로역', '대구대명동', '대명10동', '대명동', '봉덕동', '송현동', '이천동'], ['성서', '상인역', '성서계대', '진천역', '계명대', '월광수변공원', '성서공단', '죽전네거리', '갈산동', '감삼동', '내당동', '대곡동', '대천동', 
'도원동', '두류동', '본동', '본리동', '상인동', '성당동', '송현동', '신당동', '용산동', '월성동', '월암동', '유천동', '이곡동', '장기동', '장동', '죽전동', '진천동', '파호동', '호림동', '호산동'], ['현풍', '가창', '다사', '비슬산', '논공', '대구화원', '대실역', '가창면', '구지면', '논공읍', '다사읍', '옥포읍', '유가읍', '하빈면', '현풍읍', '화원읍'], ['강원', '경기', '경남', '경북', '광주', '대구', '대전', '부산', '세종', '울산', '인천', '전남', '전북', '제주', '충남', '충북'], ['동천동', '경북대', '칠곡3지구', '대구칠곡', '대구역', '대구종합유통단지', '경북대학교', '칠성시장', '경북도청', '검단동', '고성동', '관음동', '구암동', '국우동', '금호동', '노곡동', '노원동', '대현동', '도남동', '동변동', '동천동', '동호동', '매천동', '복현동', '비산동', '사수동', '산격동', '서변동', '연경동', '읍내동', '조야동', '칠성동', '침산동', '태전동', '팔달동', '학정동'], ['광장코아', '내당역', '두류네거리', '내당동', '두류동', '비산동', '상리동', '원대동', '이현동', '중리동', '평리동'], ['남구', '달서구', '달성군', '동구', '북구', '서구', '수성구', '중구'], ['남구', '달서구', '달성군', '동구', '북구', '서구', '수성구', '중구']],
[['신탄진', '대청댐', '한남대', '신탄진역', '갈전동', '대화동', '덕암동', '목상동', '문평동', '미호동', '법동', '비래동', '삼정동', '상서동', '석봉동', '송촌동', '신대동', '신일동', '신탄진동', '연축동', '오정동', '와동', '용호동', '읍내동', '이현동', '장동', '중리동', '평촌동'], ['대전역', '대전복합터미널', 
'우송대', '대전터미널', '판암역', '가양동', '가오동', '구도동', '낭월동', '내탑동', '대동', '대별동', '대성동', '마산동', '비룡동', '사성동', '삼괴동', '삼성동', '삼정동', '상소동', '성남동', '세천동', '소제동', '소호동', '신상동', '신안동', '신촌동', '신하동', '신흥동', '오동', '용운동', '용전동', '원동', '이사동', '인동', '자양동', '장척동', '정동', '주산동', '주촌동', '중동', '직동', '천동', '추동', '판암동', '하소동', '홍도동', '효동', '효평동'], ['시청역', '대전시청', '용문역', '둔산', '탄방역', '가수원동', '가장동', '갈마동', '관저동', '괴곡동', '괴정동', '내동', '도마동', '도안동', '둔산동', '만년동', '매노동', '변동', '복수동', '봉곡동', '산직동', '오동', '용문동', '용촌동', '우명동', '원정동', '월평동', '장안동', '정림동', '탄방동', '평촌동', '흑석동'], ['유성온천역', '유성온천', '반석역', '충남대', '수통골', '노은', '노은역', '가정동', '갑동', '계산동', '관평동', '교촌동', '구룡동', '구성동', '구암동', '궁동', '금고동', '금탄동', '노은동', '대동', '대정동', '덕명동', '덕진동', '도룡동', '둔곡동', '문지동', '반석동', '방동', '방현동', '복용동', '봉명동', '봉산동', '상대동', '성북동', '세동', '송강동', '송정동', '수남동', '신동', '신봉동', '신성동', '안산동', '어은동', '외삼동', '용계동', '용산동', '원내동', '원신흥동', '원촌동', '자운동', '장대동', '장동', '전민동', '죽동', '지족동', '추목동', '탑립동', '하기동', '학하동', '화암동'], ['서대전역', '세이백화점', '중앙로역', '보문산', '대전목동', '중구청', '서대전네거리역', '오월드', '구완동', '금동', '대사동', '대흥동', '목달동', '목동', '무수동', '문창동', '문화동', '부사동', '사정동', '산성동', '석교동', '선화동', '안영동', '어남동', '오류동', '옥계동', '용두동', '유천동', '은행동', '정생동', '중촌동', '침산동', '태평동', '호동']],
[['명지', '김해공항', '공항역', '평강역', '대저역', '강동동', '구랑동', '녹산동', '눌차동', '대저동', '대항동', '동선동', '명지동', '미음동', '범방동', '봉림동', '생곡동', '성북동', '송정동', '식만동', '신호동', '죽동동', '죽림동', '지사동', '천성동', '화전동'], ['부산대', '금정산성', '범어사', '부산대역', '구서역', '두실역', '노포역', '금정산', '남산역', '구서동', '금사동', '금성동', '남산동', '노포동', '두구동', '부곡동', '서동', '선동', '오륜동', '장전동', '청룡동', '회동동'], ['정관', '일광', '장안사', '정관신도시', '기장읍', '일광면', '장안읍', '정관읍', '철마면'], ['경성대', '부경대', '대연역', '이기대', '대연', '못골역', '오륙도', '부산경성대', '지게골역', '감만동', '대연동', '문현동', '용당동', '용호동', '우암동'], ['부산역', '초량', '범일역', '부산진역', '초량역', '범일동', '범천동', '수정동', '좌천동', '초량동'], ['온천장', '동래역', '온천천', '명륜역', '사직', '미남역', '서원시장', '부산사직동', '동래메가마트', '거제동', '낙민동', '명륜동', '명장동', '복천동', '사직동', '수안동', '안락동', '온천동', '칠산동'], ['서면', '전포', '서면역', '전포역', '초읍', '양정', '개금', '부전역', '가야동', '개금동', '당감동', '범전동', '범천동', '부암동', '부전동', '양정동', '연지동', '전포동', '초읍동'], ['덕천', '화명', '덕천역', '구포', '구포역', '화명역', '만덕역', '숙등역', '금곡역', '구포동', '금곡동', '덕천동', '만덕동', '화명동'], ['사상역', '냉정역', '덕포', '사상터미널', '주례', '동서대', '감전역', '모라역', '감전동', '괘법동', '덕포동', '모라동', '삼락동', '엄궁동', '주례동', '학장동'], ['다대포', '하단', '하단역', '괴정', '사하역', '신평', '감천', '동아대', '장림', '감천동', '괴정동', '구평동', '다대동', '당리동', '서대신동', '신평동', '장림동', '하단동'], ['부산송도', '동아대', '부산송도해수욕장', '서대신역', '토성역', '감천동', '남부민동', '남포동', '동대신동', '부민동', '부용동', '서대신동', '아미동', '암남동', '초장동', '충무동', '토성동'], ['광안리', '수영역', '금련산역', '망미역', '부산광안리', '남천역', '남천', '광안역', '민락역', '광안동', '남천동', '망미동', '민락동', '수영동'], ['시청역', '연산', '부산시청', '온천천', '연산역', '거제역', '토곡', '부산법원', '부산교대역', '부산시청역', '부산교대', '거제동', '안락동', '연산동'], ['태종대', '남항동', '대교동', '대평동', '동삼동', '봉래동', '신선동', '영선동', '청학동'], ['남포동', '중앙역', '자갈치시장', '부평시장', '남포역', '자갈치역', '국제시장', '광복동', '남포동', '대창동', '대청동', '동광동', '보수동', '부평동', '신창동', '영주동', '중앙동', '창선동'], ['해운대', '송정', '센텀시티', '해리단길', '청사포', '해운대역', '송정해수욕장', '마린시티', '동백역', '달맞이고개', '반송동', '반여동', '석대동', '송정동', '우동', '재송동', '좌동', '중동']]
,[[], [], ['감성리', '국곡리', '금천리', '남곡리', '달전리', '대박리', '도남리', '도암리', '두만리', '박산리', '발산리', '봉암리', '부용리', '성강리', '성덕리', '신촌리', '영곡리', '영대리', '영치리', '용담리', '용포리', '원봉리', '장재리', '축산리', '호탄리', '황용리'], [], [], [], [], [], [], [], ['갈산리', '금호리', '노호리', '등곡리', '문곡리', '부강리', '산수리', '행산리'], [], [], [], ['고등리', '대곡리', '소정리', '운당리'], [], [], ['누리리', '눌왕리', '보통리', '세종리', '수산리', '연기리', '한별리'], ['내판리', '노송리', '다솜리', '명학리', '문주리', '송용리', '예양리', '용호리', '응암리', '합강리'], ['고복리', '국촌리', '기룡리', '봉암리', '부동리', '성제리', '신대리', '쌍류리', '쌍전리', '와촌리', '용암리', '월하리', '청라리'], ['금암리', '대교리', '도계리', '봉안리', '산학리', '송문리', '송정리', '송학리', '용암리', '용현리', '은용리', '태산리', '평기리', '하봉리'], ['노장리', '미곡리', '보덕리', '봉대리', '석곡리', '송곡리', '송성리', '송정리', '심중리', '청람리', '청송리'], ['관정리', '금사리', '노곡리', '다방리', '달전리', '동교리', '서정리', '신방리', '신정리', '신흥리', '양곡리', '영당리', '원성리', '유천리', '읍내리'], ['교리', '남리', '명리', '번암리', '봉산리', '상리', '서창리', '신안리', '신흥리', '원리', '정리', '죽림리', '침산리', '평리'], [], [], [], [], []],
[['삼산', '울산달동', '울산대', '태화강역', '공업탑', '장생포', '고사동', '남화동', '달동', '대현동', '두왕동', '매암동', '무거동', '부곡동', '삼산동', '상개동', '선암동', '성암동', '수암동', '신정동', '야음동', '여천동', '옥동', '용연동', '용잠동', '장생포동', '황성동'], ['일산', '방어진', '일산해수욕장', '대송동', '동부동', '미포동', '방어동', '서부동', '일산동', '전하동', '주전동', '화정동'], ['명촌', '울산공항', '정자해수욕장', '가대동', '구유동', '달천동', '당사동', '대안동', '매곡동', '명촌동', '무룡동', '산하동', '상안동', '송정동', '시례동', '신명동', '신천동', '신현동', '양정동', '어물동', '연암동', '염포동', '정자동', '중산동', '진장동', '창평동', '천곡동', '호계동', '화봉동', '효문동'], ['언양', '두동면', '두서면', '범서읍', '삼남읍', '삼동면', '상북면', '서생면', '언양읍', '온산읍', '온양읍', '웅촌면', '청량읍'], ['교동', '남외동', '다운동', '동동', '반구동', '병영동', '복산동', '북정동', '서동', '성남동', '성안동', '약사동', '옥교동', '우정동', '유곡동', '장현동', '태화동', '학산동', '학성동']],
[['석모도', '강화읍', '교동면', '길상면', '내가면', '불은면', '삼산면', '서도면', '선원면', '송해면', '양도면', '양사면', '하점면', '화도면'], ['계산역', '작전역', '계양구청', '아라뱃길', '계양역', '계산', '계산택지', '박촌역', '임학역', '갈현동', '계산동', '귤현동', '다남동', '동양동', '둑실동', '목상동', '박촌동', '방축동', '병방동', '상야동', '서운동', '선주지동', '오류동', '용종동', '이화동', '임학동', '작전동', '장기동', '평동', '하야동', '효성동'], ['구월동', '소래포구', '예술회관역', '인천터미널', '인천시청', '인천대공원', '인천논현동', '간석역', '간석동', '고잔동', '구월동', '남촌동', '논현동', '도림동', '만수동', '서창동', '수산동', '십정동', '운연동', '장수동'], ['도원역', '금곡동', '만석동', '송림동', '송현동', '창영동', '화수동', '화평동'], ['주안', '주안역', '인하대', '인하대후문', '제물포', '인천용현동', '제물포역', '도화역', '인천터미널역', '관교동', '도화동', '문학동', '숭의동', '용현동', '주안동', '학익동'], ['부평역', '부평구청', '동암역', '부평시장역', '굴포천역', '갈산역', '부평시장', '부평구청역', '백운역', '부개역', '간석동', '갈산동', '구산동', '부개동', '부평동', '산곡동', '삼산동', '십정동', '일신동', '청천동'], ['청라', '검단사거리', '아라뱃길', '검암역', '검암', '거북시장', '인천서구청', '인천가좌동', '천안병천', '청라지구', '국제성모병원', '가정동', '가좌동', '검암동', '경서동', '공촌동', '금곡동', '당하동', '대곡동', '마전동', '백석동', '불로동', '석남동', '시천동', '신현동', '심곡동', '연희동', '오류동', '왕길동', '원당동', '원창동', '청라동'], ['송도', '테크노파크역', '송도신도시', '송도유원지', '선학역', '스퀘어원', '원인재역', '인천대입구역', '동춘동', '선학동', '송도동', '연수동', '옥련동', '청학동', '학익동'], ['영흥도', '선재도', '백령도', '연평도', '대청면', '덕적면', '백령면', '북도면', '연평면', '영흥면', '자월면'], ['영종도', '을왕리', '차이나타운', '월미도', '인천공항', '연안부두', '운서역', '무의도', '동인천역', '신포시장', '경동', '관동', '남북동', '내동', '답동', '덕교동', '도원동', '무의동', '북성동', '사동', '선린동', '선화동', '송월동', '송학동', '신생동', '신포동', '신흥동', '용동', '운남동', '운북동', '운서동', '유동', '율목동', '을왕동', '인현동', '전동', '중산동', '중앙동', '항동', '해안동']],
[['강진읍', '군동면', '대구면', '도암면', '마량면', '병영면', '성전면', '신전면', '옴천면', '작천면', '칠량면'], ['나로도', '고흥읍', '과역면', '금산면', '남양면', '대서면', '도덕면', '도양읍', '도화면', '동강면', '동일면', '두원면', '봉래면', '영남면', '점암면', '포두면', '풍양면'], ['겸면', '고달면', '곡성읍', '목사동면', '삼기면', '석곡면', '오곡면', '오산면', '옥과면', '입면', '죽곡면'], ['광양읍', '광영동', '금호동', '다압면', '도이동', '마동', '봉강면', '성황동', '옥곡면', '옥룡면', '중군동', '중동', '진상면', '진월면', '태인동', '황금동', '황길동'], ['간전면', '광의면', '구례읍', '마산면', '문척면', '산동면', '용방면', '토지면'], ['나주역', '경현동', '공산면', '과원동', '관정동', '교동', '금계동', '금성동', '금천면', '남내동', '남외동', '남평읍', '노안면', '다도면', '다시면', '대기동', '대호동', '동강면', '동수동', '문평면', '반남면', '보산동', '봉황면', '부덕동', '빛가람동', '산정동', '산포면', '삼도동', '삼영동', '서내동', '석현동', '성북동', '세지면', '송월동', '송촌동', '안창동', '영산동', '오량동', '왕곡면', '용산동', '운곡동', '이창동', '죽림동', '중앙동', '진포동', '청동', '토계동', '평산동'], ['가사문학면', '고서면', '금성면', '담양읍', '대덕면', '대전면', '무정면', '봉산면', '수북면', '용면', '월산면', '창평면'], ['목포역', '평화광장', '남악', '목포남악', '목포하당', '경동', '광동', '금동', '금화동', '남교동', '달동', '대성동', '대안동', '대양동', '대의동', '동명동', '만호동', '명륜동', '무안동', '보광동', '복만동', '부주동', '부흥동', '북교동', '산정동', '상동', '상락동', '서산동', '석현동', '수강동', '신흥동', '양동', '연산동', '영해동', '옥암동', '온금동', '용당동', '용해동', '유달동', '유동', '율도동', '이로동', '죽교동', '죽동', '중동', '중앙동', '창평동', '축복동', '측후동', '항동', '해안동', '행복동', '호남동'], ['무안공항', '망운면', '몽탄면', '무안읍', '삼향읍', '운남면', '일로읍', '청계면', '해제면', '현경면'], ['벌교', '겸백면', '노동면', '득량면', '문덕면', '미력면', '벌교읍', '보성읍', '복내면', '웅치면', '율어면', '조성면', '회천면'], ['순천역', '순천만', '순천대', '가곡동', '교량동', '금곡동', '낙안면', '남내동', '남정동', '대대동', '대룡동', '덕암동', '덕월동', '동외동', '매곡동', '별량면', '삼거동', '상사면', '생목동', '서면', '석현동', '송광면', '승주읍', '안풍동', '야흥동', '연향동', '영동', '오천동', '옥천동', '와룡동', '왕조동', '왕지동', '외서면', '용당동', '월등면', '인월동', '인제동', '장천동', '저전동', '조곡동', '조례동', '주암면', '중앙동', '풍덕동', '해룡면', '행동', '홍내동', '황전면'], ['도초면', '비금면', '신의면', '안좌면', '암태면', '압해읍', '임자면', '자은면', '장산면', '증도면', '지도읍', '팔금면', '하의면', '흑산면'], ['여수공항', '여수역', '오동도', '여천', '금오도', '경호동', '고소동', '공화동', '관문동', '광무동', '교동', '국동', '군자동', '낙포동', '남면', '남산동', '덕충동', '돌산읍', '동산동', '둔덕동', '만흥동', '묘도동', '문수동', '미평동', '봉강동', '봉계동', '봉산동', '삼산면', '상암동', '서교동', '선원동', '소라면', '소호동', '수정동', '시전동', '신기동', '신덕동', '신월동', '안산동', '여서동', '여천동', '연등동', '오림동', '오천동', '웅천동', '월내동', '월하동', '율촌면', '적량동', '종화동', '주삼동', '중앙동', '중흥동', '충무동', '평여동', '학동', '학용동', '해산동', '호명동', '화양면', '화장동', '화정면', '화치동'], ['법성포', '군남면', '군서면', '낙월면', '대마면', '묘량면', '백수읍', '법성면', '불갑면', '염산면', '영광읍', '홍농읍'], ['군서면', '금정면', '덕진면', '도포면', '미암면', '삼호읍', '서호면', '시종면', '신북면', '영암읍', '학산면'], ['보길도', '고금면', '군외면', '금당면', '금일읍', '노화읍', '보길면', '생일면', '소안면', '신지면', '약산면', '완도읍', '청산면'], ['백양사', '백양사역', '남면', '동화면', '북이면', '북일면', '북하면', '삼계면', '삼서면', '서삼면', '장성읍', '진원면', '황룡면'], ['관산읍', '대덕읍', '부산면', '안양면', '용산면', '유치면', '장동면', '장평면', '장흥읍', '회진면'], ['고군면', '군내면', '의신면', '임회면', '조도면', '지산면', '진도읍'], ['나산면', '대동면', '손불면', '신광면', '엄다면', '월야면', '학교면', '함평읍', '해보면'], ['땅끝마을', '계곡면', '마산면', '문내면', '북일면', '북평면', '산이면', '삼산면', '송지면', '옥천면', '해남읍', '현산면', '화산면', '화원면', '황산면'], ['능주면', '도곡면', '도암면', '동면', '동복면', '백아면', '사평면', '이서면', '이양면', '청풍면', '춘양면', '한천면', '화순읍']],
[['선운사', '고수면', '고창읍', '공음면', '대산면', '무장면', '부안면', '상하면', '성내면', '성송면', '신림면', '심원면', '아산면', '해리면', '흥덕면'], ['새만금', '군산대', '군산역', '군산공항', '개복동', '개사동', '개정동', '개정면', '경암동', '경장동', '구암동', '금광동', '금동', '금암동', '나운동', '나포면', '내초동', '내흥동', '대명동', '대야면', '동흥남동', '둔율동', '명산동', '문화동', '미룡동', '미원동', '미장동', '비응도동', '사정동', '산북동', '삼학동', '서수면', '서흥남동', '선양동', '성산면', '소룡동', '송창동', '송풍동', '수송동', '신관동', '신영동', '신창동', '신풍동', '신흥동', '영동', '영화동', '오룡동', '오식도동', '옥구읍', '옥도면', '옥산면', '옥서면', '월명동', '임피면', '장미동', '장재동', '조촌동', '죽성동', '중동', '중앙로', '지곡동', '창성동', '평화동', '해망동', '회현면'], ['금산사', '갈공동', '검산동', '공덕면', '광활면', '교동', '금구면', '금산면', '난봉동', '도장동', '만경읍', '명덕동', '백구면', '백산면', '백학동', '복죽동', '봉남면', '부량면', '상동동', '서암동', '서정동', '성덕면', '순동', '신곡동', '신덕동', '신월동', '신풍동', '양전동', '연정동', '오정동', '옥산동', '요촌동', '용동', '용지면', '월봉동', '월성동', '입석동', '장화동', '제월동', '죽산면', '진봉면', '청하면', '하동', '황산동', '황산면', '흥사동'], ['남원역', '갈치동', '고죽동', '광치동', '금동', '금지면', '내척동', '노암동', '대강면', '대산면', '덕과면', '도통동', '동충동', '보절면', '사매면', '산곡동', '산내면', '산동면', '송동면', '수지면', '식정동', '신정동', '신촌동', '쌍교동', '아영면', '어현동', '왕정동', '용정동', '운봉읍', '월락동', '이백면', '인월면', '조산동', '주생면', '주천면', '죽항동', '천거동', '하정동', '향교동', '화정동', '효자동'], ['남원역', '갈치동', '고죽동', '광치동', '금동', '금지면', '내척동', '노암동', '대강면', '대산면', '덕과면', '도통동', '동충동', '보절면', '사매면', '산곡동', '산내면', '산동면', '송동면', '수지면', '식정동', '신정동', '신촌동', '쌍교동', '아영면', '어현동', '왕정동', '용정동', '운봉읍', '월락동', '이백면', '인월면', '조산동', '주생면', '주천면', '죽항동', '천거동', '하정동', '향교동', '화정동', '효자동'], ['남원역', '갈치동', '고죽동', '광치동', '금동', '금지면', '내척동', '노암동', '대강면', '대산면', '덕과면', '도통동', '동충동', '보절면', '사매면', '산곡동', '산내면', '산동면', '송동면', '수지면', '식정동', '신정동', '신촌동', '쌍교동', '아영면', '어현동', '왕정동', '용정동', '운봉읍', '월락동', '이백면', '인월면', '조산동', '주생면', '주천면', '죽항동', '천거동', '하정동', '향교동', '화정동', '효자동'], ['순창읍', '구림면', '금과면', '동계면', '복흥면', '순창읍', '쌍치면', '유등면', '인계면', '적성면', '팔덕면', '풍산면'], ['삼례', '이서', '모악산', '경천면', '고산면', '구이면', '동상면', '봉동읍', '비봉면', '삼례읍', '상관면', '소양면', '용진읍', '운주면', '이서면', '화산면'], ['익산역', '원광대', '금마', '갈산동', '금강동', '금마면', '남중동', '낭산면', '덕기동', '동산동', '마동', '만석동', '망성면', '모현동', '목천동', '부송동', '삼기면', '석암동', '석왕동', '석탄동', '성당면', '송학동', '신동', '신용동', '신흥동', '어양동', '여산면', '영등동', '오산면', '왕궁면', '용동면', '용안면', '용제동', '웅포면', '월성동', '은기동', '인화동', '임상동', '정족동', '주현동', '중앙동', '창인동', '춘포면', '팔봉동', '평화동', '함라면', '함열읍', '현영동', '황등면'], ['강진면', '관촌면', '덕치면', '삼계면', '성수면', '신덕면', '신평면', '오수면', '운암면', '임실읍', '지사면', '청웅면'], ['계남면', '계북면', '번암면', '산서면', '장계면', '장수읍', '천천면'], ['덕진구', '완산구'], ['전주역', '아중리', '전주동물원', '강흥동', '고랑동', '금상동', '금암동', '남정동', '노송동', '덕진동', '도덕동', '도도동', '만성동', '반월동', '산정동', '성덕동', '송천동', '여의동', '용정동', '우아동', '원동', '인후동', '장동', '전미동', '중동', '진북동', '팔복동', '호성동', '화전동'], ['전주한옥마을', '전주신시가지', '전북도청', '전주시청', '전주남부시장', '전주남문시장', '경원동', '고사동', '교동', '남노송동', '다가동', '대성동', '동서학동', '동완산동', '삼천동', '상림동', '색장동', '서노송동', '서서학동', '서신동', '서완산동', '석구동', '용복동', '원당동', '인후동', '전동', '중노송동', '중앙동', '중인동', '중화산동', '태평동', '팔복동', '평화동', '풍남동', '효자동'], ['내장산', '정읍역', '감곡면', '고부면', '공평동', '과교동', '교암동', '구룡동', '금붕동', '내장동', '농소동', '덕천면', '망제동', '부전동', '북면', '산내면', '산외면', '삼산동', '상동', '상평동', '소성면', '송산동', '수성동', '시기동', '신월동', '신정동', '신태인읍', '쌍암동', '연지동', '영원면', '영파동', '옹동면', '용계동', '용산동', '이평면', '입암면', '장명동', '정우면', '진산동', '초산동', '칠보면', '태인면', '하모동', '하북동', '흑암동'], ['동향면', '마령면', '백운면', '부귀면', '상전면', '성수면', '안천면', '용담면', '정천면', '주천면', '진안읍']],
[['서귀포시내', '중문', '성산', '성산일출봉', '표선', '올레시장', '모슬포', '쇠소깍', '강정동', '남원읍', '대정읍', '대포동', '도순동', '동홍동', '법환동', '보목동', '상예동', '상효동', '색달동', '서귀동', '서호동', '서홍동', '성산읍', '신효동', '안덕면', '영남동', '월평동', '정방동', '중문동', '중앙동', '토평동', '표선면', '하예동', '하원동', '하효동', '호근동', '회수동'], ['제주시내', '애월', '제주공항근처', '우도', '노형동', '동문시장', '연동', '한림', '제주시청', '건입동', '구좌읍', '내도동', '노형동', '도남동', '도두동', '도련동', '도평동', '봉개동', '삼도동', '삼양동', '아라동', '애월읍', '연동', '영평동', '오등동', '오라동', '외도동', '용강동', '용담동', '우도면', '월평동', '이도동', '이호동', '일도동', '조천읍', '추자면', '한경면', '한림읍', '해안동', '화북동', '회천동']],
[['계룡', '금암동', '두마면', '신도안면', '엄사면'], ['공산성', '공주대', '검상동', '계룡면', '교동', '금성동', '금학동', '금흥동', '동현동', '무릉동', '반죽동', '반포면', '봉정동', '봉황동', '사곡면', '산성동', '상왕동', '석장리동', '소학동', '송선동', '신관동', '신기동', '신풍면', '쌍신동', '오곡동', '옥룡동', '우성면', '웅진동', '월미동', '월송동', '유구읍', '의당면', '이인면', '정안면', '주미동', '중동', '중학동', '탄천면', '태봉동'], ['추부', '군북면', '금산읍', '금성면', '남이면', '남일면', '복수면', '부리면', '제원면', '진산면', '추부면'], ['논산역', '강경', '연무대', '가야곡면', '강경읍', '강산동', '관촉동', '광석면', '내동', '노성면', '대교동', '덕지동', '등화동', '반월동', '벌곡면', '부적면', '부창동', '상월면', '성동면', '양촌면', '연무읍', '연산면', '은진면', '지산동', '채운면', '취암동', '화지동'], ['한진포구', '고대면', '구룡동', '대덕동', '대호지면', '면천면', '사기소동', '석문면', '송산면', '송악읍', '수청동', '순성면', '시곡동', '신평면', '용연동', '우강면', '우두동', '원당동', '읍내동', '정미면', '채운동', '합덕읍', '행정동'], ['대천', '대천해수욕장', '대천역', '궁촌동', '남곡동', '남포면', '내항동', '대천동', '동대동', '명천동', '미산면', '성주면', '신흑동', '오천면', '요암동', '웅천읍', '주교면', '주산면', '주포면', '죽정동', '천북면', '청라면', '청소면', '화산동'], ['구룡면', '규암면', '남면', '내산면', '부여읍', '석성면', '세도면', '양화면', '옥산면', '외산면', '은산면', '임천면', '장암면', '초촌면', '충화면', '홍산면'], ['삽교호', '해미읍성', '팔봉산', '갈산동', '고북면', '대산읍', '덕지천동', '동문동', '부석면', '석남동', '석림동', '성연면', '수석동', '양대동', '예천동', '오남동', '온석동', '운산면', '음암면', '읍내동', '인지면', '잠홍동', '장동', '죽성동', '지곡면', '팔봉면', '해미면'], ['기산면', '마산면', '마서면', '문산면', '비인면', '서면', '서천읍', '시초면', '장항읍', '종천면', '판교면', '한산면', '화양면'], ['배방', '온양온천', '선문대', '온양', '탕정', '온양온천역', '둔포', '도고', '권곡동', '기산동', '남동', '도고면', '둔포면', '득산동', '모종동', '방축동', '배미동', '배방읍', '법곡동', '선장면', '송악면', '신동', '신인동', '신창면', '실옥동', '염치읍', '영인면', '온양동', '온천동', '용화동', '음봉면', '읍내동', '인주면', '장존동', '점양동', '좌부동', '초사동', '탕정면', '풍기동'], ['덕산', '삽교', '고덕면', '광시면', '대술면', '대흥면', '덕산면', '봉산면', '삽교읍', '신암면', '신양면', '예산읍', '오가면', '응봉면'], ['동남구', '서북구'], ['천안역', '천안터미널', '신방통정지구', '야우리', '봉명역', '광덕면', '구룡동', '구성동', '다가동', '대흥동', '동면', '목천읍', '문화동', '병천면', '봉명동', '부성동', '북면', '사직동', '삼룡동', '성남면', '성황동', '수신면', '신방동', '신부동', '쌍용동', '안서동', '영성동', '오룡동', '용곡동', '원성동', '유량동', '청당동', '청수동', '풍세면'], ['불당동', '천안아산역', '지웰시티', '천안아산', '모다아울렛', '두정동', '백석동', '봉명동', '부대동', '불당동', '성거읍', '성성동', '성정동', '성환읍', '신당동', '쌍용동', '업성동', '와촌동', '입장면', '직산읍', '차암동'], ['남양면', '대치면', '목면', '비봉면', '운곡면', '장평면', '정산면', '청남면', '청양읍', '화성면'], ['안면도', '고남면', '근흥면', '남면', '소원면', '안면읍', '원북면', '이원면', '태안읍'], ['광천', '갈산면', '결성면', '광천읍', '구항면', '금마면', '서부면', '은하면', '장곡면', '홍동면', '홍북읍', '홍성읍']],
[['감물면', '괴산읍', '문광면', '불정면', '사리면', '소수면', '연풍면', '장연면', '청안면', '청천면', '칠성면'], ['가곡면', '단성면', '단양읍', '대강면', '매포읍', '어상천면', '영춘면', '적성면'], ['속리산', '내북면', '마로면', '보은읍', '산외면', '삼승면', '속리산면', '수한면', '장안면', '탄부면', '회남면', 
'회인면'], ['매곡면', '상촌면', '심천면', '양강면', '양산면', '영동읍', '용산면', '용화면', '추풍령면', '학산면', '황간면'], ['군북면', '군서면', '동이면', '안남면', '안내면', '옥천읍', '이원면', '청산면', '청성면'], ['충북혁신도시', '금왕', '감곡', '감곡면', '금왕읍', '대소면', '맹동면', '삼성면', '생극면', 
'소이면', '원남면', '음성읍'], ['충주호', '의림지', '제천역', '강제동', '고명동', '고암동', '교동', '금성면', '남천동', '대랑동', '덕산면', '동현동', '두학동', '명동', '명지동', '모산동', '백운면', '봉양읍', '산곡동', '서부동', '송학면', '수산면', '신동', '신백동', '신월동', '영천동', '왕암동', '의림동', '자 작동', '장락동', '중앙로', '천남동', '청전동', '청풍면', '하소동', '한수면', '화산동', '흑석동'], ['도안면', '증평읍'], ['광혜원', '광혜원면', '덕산면', '덕산읍', '문백면', '백곡면', '이월면', '진천읍', '초평면'], ['상당구', '서원구', '청원구', '흥덕구'], ['대청호', '대청댐', '청주성안길', '수암골', '상당산성', '가덕면', '금천동', '남문로', '남일면', '남주동', '낭성면', '대성동', '명암동', '문의면', '문화동', '미원면', '방서동', '북문로', '산성동', '서문동', '서운동', '석교동', '수동', '영동', '영운동', '용담동', '용암동', '용정동', '운동동', '월오동', '지북동', '탑동', '평촌동'], ['충북대', '충대중문', '개신동', '남이면', '모충동', '미평동', '분평동', '사직동', '사창동', '산남동', '성화동', '수곡동', '장성동', '장암동', '죽림동', '현도면'], ['오창', '청주대', '청주공항', '강서동', '내덕동', '내수읍', '북이면', '사천동', '오동동', '오창읍', '외남동', '외평동', '외하동', '우암동', '율량동', '정북동', '정상동', '정하동', '주성동', '주중동'], ['오송역', '오송', '충북대', '신성동', '지웰시티', '하복대', '교원대', '가경동', '강내면', '강서동', '남촌동', '내곡동', '동막동', '문암동', '복대동', '봉명동', '비하동', '상신동', '서촌동', '석곡동', '석소동', '성화개신죽림동', '송절동', '송정동', '수의동', '신대동', '신봉동', '신성동', '신전동', '신촌동', '오송읍', '옥산면', '외북동', '운천동', '원평동', '정봉동', '지동동', '평동', '향정동', '현암동', '화계동', '휴암동'], ['수안보', '충주호', '충주역', '충주주덕', '가주동', '교현동', '금가면', '금릉동', '노은면', '단월동', '달천동', '대소원면', '동량면', '목벌동', '목행동', '문화동', '봉방동', '산척면', '살미면', '성남동', '성내동', '성서동', '소태면', '수안보면', '신니면', '안림동', '앙성면', '엄정면', '연수동', '용관동', '용두동', '용산동', '용탄동', '종민동', '주덕읍', '중앙탑면', '지현동', '직동', '충의동', '충인동', '칠금동', '풍동', '호암동']]
]

# STR_URL += "%EA%B0%95%EB%82%A8%EA%B5%AC"  # 구
# STR_URL += "%20" +  ""# 동 / 역
# STR_URL += "&query=%EB%B0%98%EB%A0%A4%EB%8F%99%EB%AC%BC"  # 반려동물


class DiningCodeCrawler:

  def __init__(self):
    self.errorList = list()
    self.crawlingCategory = list()
    self.crawlingCategory.append({
        STR_NAME: 'dining_code_id',
        STR_URL: "https://www.diningcode.com/list.dc?addr=",
    })

  def StartCrawling(self):
    print(self.crawlingCategory)
    self.chrome_option = webdriver.ChromeOptions()
    self.chrome_option.add_argument('--headless')
    self.chrome_option.add_argument('--window-size=1920,1080')
    self.chrome_option.add_argument('--start-maximized')
    self.chrome_option.add_argument('--disable-gpu')
    self.chrome_option.add_argument('lang=ko=KR')

    if __name__ == '__main__':
      pool = Pool(processes=PROCESS_COUNT)
      pool.map(self.CrawlingCategory, self.crawlingCategory)
      pool.close()
      pool.join()

  def CrawlingCategory(self, categoryValue):
    crawlingName = categoryValue[STR_NAME]
    crawlingURL = categoryValue[STR_URL]

    print('Crawling Start : ' + crawlingName)

    #data
    crawlingFile = open(f'{crawlingName}.csv', 'w',
                        newline='', encoding='utf8')
    crawlingData_csvWriter = csv.writer(crawlingFile)
    # crawlingData_csvWriter.writerow([self.GetCurrentDate().strftime('%Y-%m-%d %H:%M:%S')])

    try:
      browser = webdriver.Chrome(CHROMEDRIVER_PATH, options=self.chrome_option)
      # browser.implicitly_wait(5)
      for si_idx, SI in enumerate(SI_LIST):
        tmpSiURL = categoryValue[STR_URL] + SI + "%20"
        for gu_idx, GU in enumerate(GU_LIST[si_idx]):
          tmpGuURL = tmpSiURL + GU + "%20"
          for dong_idx, DONG in enumerate(DONG_LIST[si_idx][gu_idx]):
            url = tmpGuURL + "%2B" + DONG + "&query=%EB%B0%98%EB%A0%A4%EB%8F%99%EB%AC%BC"
            print(SI + " " + GU + " "+ DONG)
            browser.get(url)
            sleep(0.1)
            # 데이터 결과 없는 경우 예외처리해야함
            try:
                browser.find_element(By.XPATH, '//div[@class="Popup-Window"]').is_displayed();
            except:
                #페이지 로딩 기다리기
                wait = WebDriverWait(browser, 10)
                wait.until(EC.element_to_be_clickable((By.ID, 'arrow')))
                # 마우스로 리스트쪽 클릭해서 포커스 두기
                # browser.find_element(By.XPATH, '//ul[@class="SearchTagList"]').click()
                # 스크롤 최하단까지 내리기 (20개씩 최대 100개 나오므로 5번 내려야함)
                browser.find_element(By.XPATH, '//div[@class="PoiList"]').click()
                liElement = browser.find_element(
                    By.XPATH, '//div[@class="sc-crXcEl jXYOev PoiListMain"]')
                browser.execute_script("arguments[0].scrollBy(0, 3800)", liElement)
                sleep(0.1)
                browser.execute_script("arguments[0].scrollBy(0, 3800)", liElement)
                sleep(0.1)
                browser.execute_script("arguments[0].scrollBy(0, 3800)", liElement)
                sleep(0.1)
                browser.execute_script("arguments[0].scrollBy(0, 3800)", liElement)
                sleep(0.1)
                browser.execute_script("arguments[0].scrollBy(0, 3800)", liElement)
                sleep(0.1)

                html = browser.find_element(
                    By.XPATH, '//div[@class="PoiList"]').get_attribute('outerHTML')
                selector = Selector(text=html)
                items = selector.xpath('//ol[@class="sc-bczRLJ dbLsXe"]/li[@class="PoiBlockContainer"]')
                for item in items:
                    itemId = item.xpath('./div[@class="PoiBlock"]').attrib['id'][5:]
                    # print(itemId)
                    crawlingData_csvWriter.writerow([itemId])
    except Exception as e:
        print("Error - " + crawlingName + '->')
        print(e)
        self.errorList.append(crawlingName)

    crawlingFile.close()

    print('Crawling Finish : ' + crawlingName)

  def getCurrentDate(self):
    tz = timezone(TIMEZONE)
    return (datetime.now(tz))


if __name__ == '__main__':
  cralwer = DiningCodeCrawler()
  cralwer.StartCrawling()
