# -*- coding: utf-8 -*-

# danawa_cralwer.py
# sammy310


from ctypes import sizeof
import enum
from selenium import webdriver
from selenium.webdriver.common.by import By
from selenium.webdriver.support.ui import WebDriverWait
from selenium.webdriver.support import expected_conditions as EC

from selenium.webdriver.common.action_chains import ActionChains
from selenium.webdriver.common.keys import Keys

from scrapy.selector import Selector

from datetime import datetime
from datetime import timedelta
from pytz import timezone
import csv
import os
import os.path
import shutil
from time import sleep

from multiprocessing import Pool

from soupsieve import select


PROCESS_COUNT = 2
CRAWLING_DATA_CSV_FILE = 'DiningCode.csv'
DATA_PATH = 'crawl_data'
DATA_REFRESH_PATH = f'{DATA_PATH}/Last_Data'

TIMEZONE = 'Asia/Seoul'

CHROMEDRIVER_PATH = 'chromedriver.exe'

DATA_DIVIDER = '---'
DATA_REMARK = '//'
DATA_ROW_DIVIDER = '_'
DATA_PRODUCT_DIVIDER = '|'

STR_NAME = 'name'
STR_URL = 'url'


SI_LIST = ['대구', '대전', '부산', '세종', '울산', '인천', '전남', '전북', '제주', '충남', '충북']

# SI_LIST = ['서울']

# GU_LIST = [
#     ['강남구',  '강동구',  '강북구',  '강서구',  '관악구',  '광진구',  '구로구',  '금천구',  '노원구',  '도봉구',  '동대문구',  '동작구',  '마포구',
#         '서대문구',  '서초구',  '성동구',  '성북구',  '송파구',  '양천구',  '영등포구',  '용산구',  '은평구',  '종로구',  '중구',  '중랑구'],
#     ['강릉시', '고성군', '동해시', '삼척시', '속초시', '양구군', '양양군', '영월군', '원주시',
#      '인제군', '정선군', '철원군', '춘천시', '태백시', '평창군', '홍천군', '화천군', '횡성군'],
#     ['가평군', '고양시', '고양시 덕양구', '고양시 일산동구', '고양시 일산서구', '과천시', '광명시', '광주시', '구리시', '군포시', '김포시', '남양주시', '동두천시', '부천시', '성남시', '성남시 분당구', '성남시 수정구', '성남시 중원구', '수원시', '수원시 권선구', '수원시 영통구', '수원시 장안구', '수원시 팔달구',
#      '시흥시', '안산시', '안산시 단원구', '안산시 상록구', '안성시', '안양시', '안양시 동안구', '안양시 만안구', '양주시', '양평군', '여주시', '연천군', '오산시', '용인시', '용인시 기흥구', '용인시 수지구', '용인시 처인구', '의왕시', '의정부시', '이천시', '파주시', '평택시', '포천시', '하남시', '화성시'],
#      ['거제시','거창군','고성군','김해시','남해군','밀양시','사천시','산청군','양산시','의령군','진주시','창녕군','창원시','창원시 마산합포구','창원시 마산회원구','창원시 성산구','창원시 의창구','창원시 진해구','통영시','하동군','함안군','함양군','합천군'],
#      ['경산시','경주시','고령군','구미시','군위군','김천시','문경시','봉화군','상주시','성주군','안동시','영덕군','영양군','영주시','영천시','예천군','울릉군','울진군','의성군','청도군','청송군','칠곡군','포항시','포항시 남구','포항시 북구'],
#      ['광산구','남구','동구','북구','서구'],
#      ['남구','달서구','달성군','동구','북구','서구','수성구','중구'],
#      ['대덕구','동구','서구','유성구','중구'],
#      ['강서구','금정구','기장군','남구','동구','동래구','부산진구','북구','사상구','사하구','서구','수영구','연제구','영도구','중구','해운대구'],
#      ['가람동','고운동','금남면','나성동','다정동','대평동','도담동','반곡동','보람동','보람동','부강면','산울동','새롬동','소담동','소정면','아름동','어진동','연기면','연동면','연서면','장군면','전동면','전의면','조치원읍','종촌동','집현동','한솔동','합강동','해밀동'],
#      ['남구','동구','북구','울주군','중구'],
#      ['강화군','계양구','남동구','동구','미추홀구','부평구','서구','연수구','옹진군','중구'],
#      ['강진군','고흥군','곡성군','광양시','구례군','나주시','담양군','목포시','무안군','보성군','순천시','신안군','여수시','영광군','영암군','완도군','장성군','장흥군','진도군','함평군','해남군','화순군'],
#      ['고창군','군산시','김제시','남원시','무주군','부안군','순창군','완주군','익산시','임실군','장수군','전주시','전주시 덕진구','전주시 완산구','정읍시','진안군'],
#      ['서귀포시','제주시'],
#      ['계룡시','공주시','금산군','논산시','당진시','보령시','부여군','서산시','서천군','아산시','예산군','천안시','천안시 동남구','천안시 서북구','청양군','태안군','홍성군'],
#      ['괴산군','단양군','보은군','영동군','옥천군','음성군','제천시','증평군','진천군','청주시','청주시 상당구','청주시 서원구','청주시 청원구','청주시 흥덕구','충주시']
# ]
GU_LIST = [
     ['동구','북구','서구','수성구','중구'],
     ['대덕구','동구','서구','유성구','중구'],
     ['강서구','금정구','기장군','남구','동구','동래구','부산진구','북구','사상구','사하구','서구','수영구','연제구','영도구','중구','해운대구'],
     ['가람동','고운동','금남면','나성동','다정동','대평동','도담동','반곡동','보람동','보람동','부강면','산울동','새롬동','소담동','소정면','아름동','어진동','연기면','연동면','연서면','장군면','전동면','전의면','조치원읍','종촌동','집현동','한솔동','합강동','해밀동'],
     ['남구','동구','북구','울주군','중구'],
     ['강화군','계양구','남동구','동구','미추홀구','부평구','서구','연수구','옹진군','중구'],
     ['강진군','고흥군','곡성군','광양시','구례군','나주시','담양군','목포시','무안군','보성군','순천시','신안군','여수시','영광군','영암군','완도군','장성군','장흥군','진도군','함평군','해남군','화순군'],
     ['고창군','군산시','김제시','남원시','무주군','부안군','순창군','완주군','익산시','임실군','장수군','전주시','전주시 덕진구','전주시 완산구','정읍시','진안군'],
     ['서귀포시','제주시'],
     ['계룡시','공주시','금산군','논산시','당진시','보령시','부여군','서산시','서천군','아산시','예산군','천안시','천안시 동남구','천안시 서북구','청양군','태안군','홍성군'],
     ['괴산군','단양군','보은군','영동군','옥천군','음성군','제천시','증평군','진천군','청주시','청주시 상당구','청주시 서원구','청주시 청원구','청주시 흥덕구','충주시']
]
DONG_LIST = [
[['이사동', '인동', '자양동', '장척동', '정동', '주산동', '주촌동', '중동', '직동', '천동', '추동', '판암동', '하소동', '홍도동', '효동', '효평동'], ['시청역', '대전시청', '용문역', '둔산', '탄방역', '가수원동', '가장동', '갈마동', '관저동', '괴곡동', '괴정동', '내동', '도마동', '도안동', '둔산동', '만년동', '매노동', '변동', '복수동', '봉곡동', '산직동', '오동', '용문동', '용촌동', '우명동', '원정동', '월평동', '장안동', '정림동', '탄방동', '평촌동', '흑석동'], ['유성온천역', '유성온천', '반석역', '충남대', '수통골', '노은', '노은역', '가정동', '갑동', '계산동', '관평동', '교촌동', '구룡동', '구성동', '구암동', '궁동', '금고동', '금탄동', '노은동', '대동', '대정동', '덕명동', '덕진동', '도룡동', '둔곡동', '문지동', '반석동', '방동', '방현동', '복용동', '봉명동', '봉산동', '상대동', '성북동', '세동', '송강동', '송정동', '수남동', '신동', '신봉동', '신성동', '안산동', '어은동', '외삼동', '용계동', '용산동', '원내동', '원신흥동', '원촌동', '자운동', '장대동', '장동', '전민동', '죽동', '지족동', '추목동', '탑립동', '하기동', '학하동', '화암동'], ['서대전역', '세이백화점', '중앙로역', '보문산', '대전목동', '중구청', '서대전네거리역', '오월드', '구완동', '금동', '대사동', '대흥동', '목달동', '목동', '무수동', '문창동', '문화동', '부사동', '사정동', '산성동', '석교동', '선화동', '안영동', '어남동', '오류동', '옥계동', '용두동', '유천동', '은행동', '정생동', '중촌동', '침산동', '태평동', '호동']],
[['명지', '김해공항', '공항역', '평강역', '대저역', '강동동', '구랑동', '녹산동', '눌차동', '대저동', '대항동', '동선동', '명지동', '미음동', '범방동', '봉림동', '생곡동', '성북동', '송정동', '식만동', '신호동', '죽동동', '죽림동', '지사동', '천성동', '화전동'], ['부산대', '금정산성', '범어사', '부산대역', '구서역', '두실역', '노포역', '금정산', '남산역', '구서동', '금사동', '금성동', '남산동', '노포동', '두구동', '부곡동', '서동', '선동', '오륜동', '장전동', '청룡동', '회동동'], ['정관', '일광', '장안사', '정관신도시', '기장읍', '일광면', '장안읍', '정관읍', '철마면'], ['경성대', '부경대', '대연역', '이기대', '대연', '못골역', '오륙도', '부산경성대', '지게골역', '감만동', '대연동', '문현동', '용당동', '용호동', '우암동'], ['부산역', '초량', '범일역', '부산진역', '초량역', '범일동', '범천동', '수정동', '좌천동', '초량동'], ['온천장', '동래역', '온천천', '명륜역', '사직', '미남역', '서원시장', '부산사직동', '동래메가마트', '거제동', '낙민동', '명륜동', '명장동', '복천동', '사직동', '수안동', '안락동', '온천동', '칠산동'], ['서면', '전포', '서면역', '전포역', '초읍', '양정', '개금', '부전역', '가야동', '개금동', '당감동', '범전동', '범천동', '부암동', '부전동', '양정동', '연지동', '전포동', '초읍동'], ['덕천', '화명', '덕천역', '구포', '구포역', '화명역', '만덕역', '숙등역', '금곡역', '구포동', '금곡동', '덕천동', '만덕동', '화명동'], ['사상역', '냉정역', '덕포', '사상터미널', '주례', '동서대', '감전역', '모라역', '감전동', '괘법동', '덕포동', '모라동', '삼락동', '엄궁동', '주례동', '학장동'], ['다대포', '하단', '하단역', '괴정', '사하역', '신평', '감천', '동아대', '장림', '감천동', '괴정동', '구평동', '다대동', '당리동', '서대신동', '신평동', '장림동', '하단동'], ['부산송도', '동아대', '부산송도해수욕장', '서대신역', '토성역', '감천동', '남부민동', '남포동', '동대신동', '부민동', '부용동', '서대신동', '아미동', '암남동', '초장동', '충무동', '토성동'], ['광안리', '수영역', '금련산역', '망미역', '부산광안리', '남천역', '남천', '광안역', '민락역', '광안동', '남천동', '망미동', '민락동', '수영동'], ['시청역', '연산', '부산시청', '온천천', '연산역', '거제역', '토곡', '부산법원', '부산교대역', '부산시청역', '부산교대', '거제동', '안락동', '연산동'], ['태종대', '남항동', '대교동', '대평동', '동삼동', '봉래동', '신선동', '영선동', '청학동'], ['남포동', '중앙역', '자갈치시장', '부평시장', '남포역', '자갈치역', '국제시장', '광복동', '남포동', '대창동', '대청동', '동광동', '보수동', '부평동', '신창동', '영주동', '중앙동', '창선동'], ['해운대', '송정', '센텀시티', '해리단길', '청사포', '해운대역', '송정해수욕장', '마린시티', '동백역', '달맞이고개', '반송동', '반여동', '석대동', '송정동', '우동', '재송동', '좌동', '중동']]
,[[], [], ['감성리', '국곡리', '금천리', '남곡리', '달전리', '대박리', '도남리', '도암리', '두만리', '박산리', '발산리', '봉암리', '부용리', '성강리', '성덕리', '신촌리', '영곡리', '영대리', '영치리', '용담리', '용포리', '원봉리', '장재리', '축산리', '호탄리', '황용리'], [], [], [], [], [], [], [], ['갈산리', '금호리', '노호리', '등곡리', '문곡리', '부강리', '산수리', '행산리'], [], [], [], ['고등리', '대곡리', '소정리', '운당리'], [], [], ['누리리', '눌왕리', '보통리', '세종리', '수산리', '연기리', '한별리'], ['내판리', '노송리', '다솜리', '명학리', '문주리', '송용리', '예양리', '용호리', '응암리', '합강리'], ['고복리', '국촌리', '기룡리', '봉암리', '부동리', '성제리', '신대리', '쌍류리', '쌍전리', '와촌리', '용암리', '월하리', '청라리'], ['금암리', '대교리', '도계리', '봉안리', '산학리', '송문리', '송정리', '송학리', '용암리', '용현리', '은용리', '태산리', '평기리', '하봉리'], ['노장리', '미곡리', '보덕리', '봉대리', '석곡리', '송곡리', '송성리', '송정리', '심중리', '청람리', '청송리'], ['관정리', '금사리', '노곡리', '다방리', '달전리', '동교리', '서정리', '신방리', '신정리', '신흥리', '양곡리', '영당리', '원성리', '유천리', '읍내리'], ['교리', '남리', '명리', '번암리', '봉산리', '상리', '서창리', '신안리', '신흥리', '원리', '정리', '죽림리', '침산리', '평리'], [], [], [], [], []],
[['삼산', '울산달동', '울산대', '태화강역', '공업탑', '장생포', '고사동', '남화동', '달동', '대현동', '두왕동', '매암동', '무거동', '부곡동', '삼산동', '상개동', '선암동', '성암동', '수암동', '신정동', '야음동', '여천동', '옥동', '용연동', '용잠동', '장생포동', '황성동'], ['일산', '방어진', '일산해수욕장', '대송동', '동부동', '미포동', '방어동', '서부동', '일산동', '전하동', '주전동', '화정동'], ['명촌', '울산공항', '정자해수욕장', '가대동', '구유동', '달천동', '당사동', '대안동', '매곡동', '명촌동', '무룡동', '산하동', '상안동', '송정동', '시례동', '신명동', '신천동', '신현동', '양정동', '어물동', '연암동', '염포동', '정자동', '중산동', '진장동', '창평동', '천곡동', '호계동', '화봉동', '효문동'], ['언양', '두동면', '두서면', '범서읍', '삼남읍', '삼동면', '상북면', '서생면', '언양읍', '온산읍', '온양읍', '웅촌면', '청량읍'], ['교동', '남외동', '다운동', '동동', '반구동', '병영동', '복산동', '북정동', '서동', '성남동', '성안동', '약사동', '옥교동', '우정동', '유곡동', '장현동', '태화동', '학산동', '학성동']],
[['석모도', '강화읍', '교동면', '길상면', '내가면', '불은면', '삼산면', '서도면', '선원면', '송해면', '양도면', '양사면', '하점면', '화도면'], ['계산역', '작전역', '계양구청', '아라뱃길', '계양역', '계산', '계산택지', '박촌역', '임학역', '갈현동', '계산동', '귤현동', '다남동', '동양동', '둑실동', '목상동', '박촌동', '방축동', '병방동', '상야동', '서운동', '선주지동', '오류동', '용종동', '이화동', '임학동', '작전동', '장기동', '평동', '하야동', '효성동'], ['구월동', '소래포구', '예술회관역', '인천터미널', '인천시청', '인천대공원', '인천논현동', '간석역', '간석동', '고잔동', '구월동', '남촌동', '논현동', '도림동', '만수동', '서창동', '수산동', '십정동', '운연동', '장수동'], ['도원역', '금곡동', '만석동', '송림동', '송현동', '창영동', '화수동', '화평동'], ['주안', '주안역', '인하대', '인하대후문', '제물포', '인천용현동', '제물포역', '도화역', '인천터미널역', '관교동', '도화동', '문학동', '숭의동', '용현동', '주안동', '학익동'], ['부평역', '부평구청', '동암역', '부평시장역', '굴포천역', '갈산역', '부평시장', '부평구청역', '백운역', '부개역', '간석동', '갈산동', '구산동', '부개동', '부평동', '산곡동', '삼산동', '십정동', '일신동', '청천동'], ['청라', '검단사거리', '아라뱃길', '검암역', '검암', '거북시장', '인천서구청', '인천가좌동', '천안병천', '청라지구', '국제성모병원', '가정동', '가좌동', '검암동', '경서동', '공촌동', '금곡동', '당하동', '대곡동', '마전동', '백석동', '불로동', '석남동', '시천동', '신현동', '심곡동', '연희동', '오류동', '왕길동', '원당동', '원창동', '청라동'], ['송도', '테크노파크역', '송도신도시', '송도유원지', '선학역', '스퀘어원', '원인재역', '인천대입구역', '동춘동', '선학동', '송도동', '연수동', '옥련동', '청학동', '학익동'], ['영흥도', '선재도', '백령도', '연평도', '대청면', '덕적면', '백령면', '북도면', '연평면', '영흥면', '자월면'], ['영종도', '을왕리', '차이나타운', '월미도', '인천공항', '연안부두', '운서역', '무의도', '동인천역', '신포시장', '경동', '관동', '남북동', '내동', '답동', '덕교동', '도원동', '무의동', '북성동', '사동', '선린동', '선화동', '송월동', '송학동', '신생동', '신포동', '신흥동', '용동', '운남동', '운북동', '운서동', '유동', '율목동', '을왕동', '인현동', '전동', '중산동', '중앙동', '항동', '해안동']],
[['강진읍', '군동면', '대구면', '도암면', '마량면', '병영면', '성전면', '신전면', '옴천면', '작천면', '칠량면'], ['나로도', '고흥읍', '과역면', '금산면', '남양면', '대서면', '도덕면', '도양읍', '도화면', '동강면', '동일면', '두원면', '봉래면', '영남면', '점암면', '포두면', '풍양면'], ['겸면', '고달면', '곡성읍', '목사동면', '삼기면', '석곡면', '오곡면', '오산면', '옥과면', '입면', '죽곡면'], ['광양읍', '광영동', '금호동', '다압면', '도이동', '마동', '봉강면', '성황동', '옥곡면', '옥룡면', '중군동', '중동', '진상면', '진월면', '태인동', '황금동', '황길동'], ['간전면', '광의면', '구례읍', '마산면', '문척면', '산동면', '용방면', '토지면'], ['나주역', '경현동', '공산면', '과원동', '관정동', '교동', '금계동', '금성동', '금천면', '남내동', '남외동', '남평읍', '노안면', '다도면', '다시면', '대기동', '대호동', '동강면', '동수동', '문평면', '반남면', '보산동', '봉황면', '부덕동', '빛가람동', '산정동', '산포면', '삼도동', '삼영동', '서내동', '석현동', '성북동', '세지면', '송월동', '송촌동', '안창동', '영산동', '오량동', '왕곡면', '용산동', '운곡동', '이창동', '죽림동', '중앙동', '진포동', '청동', '토계동', '평산동'], ['가사문학면', '고서면', '금성면', '담양읍', '대덕면', '대전면', '무정면', '봉산면', '수북면', '용면', '월산면', '창평면'], ['목포역', '평화광장', '남악', '목포남악', '목포하당', '경동', '광동', '금동', '금화동', '남교동', '달동', '대성동', '대안동', '대양동', '대의동', '동명동', '만호동', '명륜동', '무안동', '보광동', '복만동', '부주동', '부흥동', '북교동', '산정동', '상동', '상락동', '서산동', '석현동', '수강동', '신흥동', '양동', '연산동', '영해동', '옥암동', '온금동', '용당동', '용해동', '유달동', '유동', '율도동', '이로동', '죽교동', '죽동', '중동', '중앙동', '창평동', '축복동', '측후동', '항동', '해안동', '행복동', '호남동'], ['무안공항', '망운면', '몽탄면', '무안읍', '삼향읍', '운남면', '일로읍', '청계면', '해제면', '현경면'], ['벌교', '겸백면', '노동면', '득량면', '문덕면', '미력면', '벌교읍', '보성읍', '복내면', '웅치면', '율어면', '조성면', '회천면'], ['순천역', '순천만', '순천대', '가곡동', '교량동', '금곡동', '낙안면', '남내동', '남정동', '대대동', '대룡동', '덕암동', '덕월동', '동외동', '매곡동', '별량면', '삼거동', '상사면', '생목동', '서면', '석현동', '송광면', '승주읍', '안풍동', '야흥동', '연향동', '영동', '오천동', '옥천동', '와룡동', '왕조동', '왕지동', '외서면', '용당동', '월등면', '인월동', '인제동', '장천동', '저전동', '조곡동', '조례동', '주암면', '중앙동', '풍덕동', '해룡면', '행동', '홍내동', '황전면'], ['도초면', '비금면', '신의면', '안좌면', '암태면', '압해읍', '임자면', '자은면', '장산면', '증도면', '지도읍', '팔금면', '하의면', '흑산면'], ['여수공항', '여수역', '오동도', '여천', '금오도', '경호동', '고소동', '공화동', '관문동', '광무동', '교동', '국동', '군자동', '낙포동', '남면', '남산동', '덕충동', '돌산읍', '동산동', '둔덕동', '만흥동', '묘도동', '문수동', '미평동', '봉강동', '봉계동', '봉산동', '삼산면', '상암동', '서교동', '선원동', '소라면', '소호동', '수정동', '시전동', '신기동', '신덕동', '신월동', '안산동', '여서동', '여천동', '연등동', '오림동', '오천동', '웅천동', '월내동', '월하동', '율촌면', '적량동', '종화동', '주삼동', '중앙동', '중흥동', '충무동', '평여동', '학동', '학용동', '해산동', '호명동', '화양면', '화장동', '화정면', '화치동'], ['법성포', '군남면', '군서면', '낙월면', '대마면', '묘량면', '백수읍', '법성면', '불갑면', '염산면', '영광읍', '홍농읍'], ['군서면', '금정면', '덕진면', '도포면', '미암면', '삼호읍', '서호면', '시종면', '신북면', '영암읍', '학산면'], ['보길도', '고금면', '군외면', '금당면', '금일읍', '노화읍', '보길면', '생일면', '소안면', '신지면', '약산면', '완도읍', '청산면'], ['백양사', '백양사역', '남면', '동화면', '북이면', '북일면', '북하면', '삼계면', '삼서면', '서삼면', '장성읍', '진원면', '황룡면'], ['관산읍', '대덕읍', '부산면', '안양면', '용산면', '유치면', '장동면', '장평면', '장흥읍', '회진면'], ['고군면', '군내면', '의신면', '임회면', '조도면', '지산면', '진도읍'], ['나산면', '대동면', '손불면', '신광면', '엄다면', '월야면', '학교면', '함평읍', '해보면'], ['땅끝마을', '계곡면', '마산면', '문내면', '북일면', '북평면', '산이면', '삼산면', '송지면', '옥천면', '해남읍', '현산면', '화산면', '화원면', '황산면'], ['능주면', '도곡면', '도암면', '동면', '동복면', '백아면', '사평면', '이서면', '이양면', '청풍면', '춘양면', '한천면', '화순읍']],
[['선운사', '고수면', '고창읍', '공음면', '대산면', '무장면', '부안면', '상하면', '성내면', '성송면', '신림면', '심원면', '아산면', '해리면', '흥덕면'], ['새만금', '군산대', '군산역', '군산공항', '개복동', '개사동', '개정동', '개정면', '경암동', '경장동', '구암동', '금광동', '금동', '금암동', '나운동', '나포면', '내초동', '내흥동', '대명동', '대야면', '동흥남동', '둔율동', '명산동', '문화동', '미룡동', '미원동', '미장동', '비응도동', '사정동', '산북동', '삼학동', '서수면', '서흥남동', '선양동', '성산면', '소룡동', '송창동', '송풍동', '수송동', '신관동', '신영동', '신창동', '신풍동', '신흥동', '영동', '영화동', '오룡동', '오식도동', '옥구읍', '옥도면', '옥산면', '옥서면', '월명동', '임피면', '장미동', '장재동', '조촌동', '죽성동', '중동', '중앙로', '지곡동', '창성동', '평화동', '해망동', '회현면'], ['금산사', '갈공동', '검산동', '공덕면', '광활면', '교동', '금구면', '금산면', '난봉동', '도장동', '만경읍', '명덕동', '백구면', '백산면', '백학동', '복죽동', '봉남면', '부량면', '상동동', '서암동', '서정동', '성덕면', '순동', '신곡동', '신덕동', '신월동', '신풍동', '양전동', '연정동', '오정동', '옥산동', '요촌동', '용동', '용지면', '월봉동', '월성동', '입석동', '장화동', '제월동', '죽산면', '진봉면', '청하면', '하동', '황산동', '황산면', '흥사동'], ['남원역', '갈치동', '고죽동', '광치동', '금동', '금지면', '내척동', '노암동', '대강면', '대산면', '덕과면', '도통동', '동충동', '보절면', '사매면', '산곡동', '산내면', '산동면', '송동면', '수지면', '식정동', '신정동', '신촌동', '쌍교동', '아영면', '어현동', '왕정동', '용정동', '운봉읍', '월락동', '이백면', '인월면', '조산동', '주생면', '주천면', '죽항동', '천거동', '하정동', '향교동', '화정동', '효자동'], ['남원역', '갈치동', '고죽동', '광치동', '금동', '금지면', '내척동', '노암동', '대강면', '대산면', '덕과면', '도통동', '동충동', '보절면', '사매면', '산곡동', '산내면', '산동면', '송동면', '수지면', '식정동', '신정동', '신촌동', '쌍교동', '아영면', '어현동', '왕정동', '용정동', '운봉읍', '월락동', '이백면', '인월면', '조산동', '주생면', '주천면', '죽항동', '천거동', '하정동', '향교동', '화정동', '효자동'], ['남원역', '갈치동', '고죽동', '광치동', '금동', '금지면', '내척동', '노암동', '대강면', '대산면', '덕과면', '도통동', '동충동', '보절면', '사매면', '산곡동', '산내면', '산동면', '송동면', '수지면', '식정동', '신정동', '신촌동', '쌍교동', '아영면', '어현동', '왕정동', '용정동', '운봉읍', '월락동', '이백면', '인월면', '조산동', '주생면', '주천면', '죽항동', '천거동', '하정동', '향교동', '화정동', '효자동'], ['순창읍', '구림면', '금과면', '동계면', '복흥면', '순창읍', '쌍치면', '유등면', '인계면', '적성면', '팔덕면', '풍산면'], ['삼례', '이서', '모악산', '경천면', '고산면', '구이면', '동상면', '봉동읍', '비봉면', '삼례읍', '상관면', '소양면', '용진읍', '운주면', '이서면', '화산면'], ['익산역', '원광대', '금마', '갈산동', '금강동', '금마면', '남중동', '낭산면', '덕기동', '동산동', '마동', '만석동', '망성면', '모현동', '목천동', '부송동', '삼기면', '석암동', '석왕동', '석탄동', '성당면', '송학동', '신동', '신용동', '신흥동', '어양동', '여산면', '영등동', '오산면', '왕궁면', '용동면', '용안면', '용제동', '웅포면', '월성동', '은기동', '인화동', '임상동', '정족동', '주현동', '중앙동', '창인동', '춘포면', '팔봉동', '평화동', '함라면', '함열읍', '현영동', '황등면'], ['강진면', '관촌면', '덕치면', '삼계면', '성수면', '신덕면', '신평면', '오수면', '운암면', '임실읍', '지사면', '청웅면'], ['계남면', '계북면', '번암면', '산서면', '장계면', '장수읍', '천천면'], ['덕진구', '완산구'], ['전주역', '아중리', '전주동물원', '강흥동', '고랑동', '금상동', '금암동', '남정동', '노송동', '덕진동', '도덕동', '도도동', '만성동', '반월동', '산정동', '성덕동', '송천동', '여의동', '용정동', '우아동', '원동', '인후동', '장동', '전미동', '중동', '진북동', '팔복동', '호성동', '화전동'], ['전주한옥마을', '전주신시가지', '전북도청', '전주시청', '전주남부시장', '전주남문시장', '경원동', '고사동', '교동', '남노송동', '다가동', '대성동', '동서학동', '동완산동', '삼천동', '상림동', '색장동', '서노송동', '서서학동', '서신동', '서완산동', '석구동', '용복동', '원당동', '인후동', '전동', '중노송동', '중앙동', '중인동', '중화산동', '태평동', '팔복동', '평화동', '풍남동', '효자동'], ['내장산', '정읍역', '감곡면', '고부면', '공평동', '과교동', '교암동', '구룡동', '금붕동', '내장동', '농소동', '덕천면', '망제동', '부전동', '북면', '산내면', '산외면', '삼산동', '상동', '상평동', '소성면', '송산동', '수성동', '시기동', '신월동', '신정동', '신태인읍', '쌍암동', '연지동', '영원면', '영파동', '옹동면', '용계동', '용산동', '이평면', '입암면', '장명동', '정우면', '진산동', '초산동', '칠보면', '태인면', '하모동', '하북동', '흑암동'], ['동향면', '마령면', '백운면', '부귀면', '상전면', '성수면', '안천면', '용담면', '정천면', '주천면', '진안읍']],
[['서귀포시내', '중문', '성산', '성산일출봉', '표선', '올레시장', '모슬포', '쇠소깍', '강정동', '남원읍', '대정읍', '대포동', '도순동', '동홍동', '법환동', '보목동', '상예동', '상효동', '색달동', '서귀동', '서호동', '서홍동', '성산읍', '신효동', '안덕면', '영남동', '월평동', '정방동', '중문동', '중앙동', '토평동', '표선면', '하예동', '하원동', '하효동', '호근동', '회수동'], ['제주시내', '애월', '제주공항근처', '우도', '노형동', '동문시장', '연동', '한림', '제주시청', '건입동', '구좌읍', '내도동', '노형동', '도남동', '도두동', '도련동', '도평동', '봉개동', '삼도동', '삼양동', '아라동', '애월읍', '연동', '영평동', '오등동', '오라동', '외도동', '용강동', '용담동', '우도면', '월평동', '이도동', '이호동', '일도동', '조천읍', '추자면', '한경면', '한림읍', '해안동', '화북동', '회천동']],
[['계룡', '금암동', '두마면', '신도안면', '엄사면'], ['공산성', '공주대', '검상동', '계룡면', '교동', '금성동', '금학동', '금흥동', '동현동', '무릉동', '반죽동', '반포면', '봉정동', '봉황동', '사곡면', '산성동', '상왕동', '석장리동', '소학동', '송선동', '신관동', '신기동', '신풍면', '쌍신동', '오곡동', '옥룡동', '우성면', '웅진동', '월미동', '월송동', '유구읍', '의당면', '이인면', '정안면', '주미동', '중동', '중학동', '탄천면', '태봉동'], ['추부', '군북면', '금산읍', '금성면', '남이면', '남일면', '복수면', '부리면', '제원면', '진산면', '추부면'], ['논산역', '강경', '연무대', '가야곡면', '강경읍', '강산동', '관촉동', '광석면', '내동', '노성면', '대교동', '덕지동', '등화동', '반월동', '벌곡면', '부적면', '부창동', '상월면', '성동면', '양촌면', '연무읍', '연산면', '은진면', '지산동', '채운면', '취암동', '화지동'], ['한진포구', '고대면', '구룡동', '대덕동', '대호지면', '면천면', '사기소동', '석문면', '송산면', '송악읍', '수청동', '순성면', '시곡동', '신평면', '용연동', '우강면', '우두동', '원당동', '읍내동', '정미면', '채운동', '합덕읍', '행정동'], ['대천', '대천해수욕장', '대천역', '궁촌동', '남곡동', '남포면', '내항동', '대천동', '동대동', '명천동', '미산면', '성주면', '신흑동', '오천면', '요암동', '웅천읍', '주교면', '주산면', '주포면', '죽정동', '천북면', '청라면', '청소면', '화산동'], ['구룡면', '규암면', '남면', '내산면', '부여읍', '석성면', '세도면', '양화면', '옥산면', '외산면', '은산면', '임천면', '장암면', '초촌면', '충화면', '홍산면'], ['삽교호', '해미읍성', '팔봉산', '갈산동', '고북면', '대산읍', '덕지천동', '동문동', '부석면', '석남동', '석림동', '성연면', '수석동', '양대동', '예천동', '오남동', '온석동', '운산면', '음암면', '읍내동', '인지면', '잠홍동', '장동', '죽성동', '지곡면', '팔봉면', '해미면'], ['기산면', '마산면', '마서면', '문산면', '비인면', '서면', '서천읍', '시초면', '장항읍', '종천면', '판교면', '한산면', '화양면'], ['배방', '온양온천', '선문대', '온양', '탕정', '온양온천역', '둔포', '도고', '권곡동', '기산동', '남동', '도고면', '둔포면', '득산동', '모종동', '방축동', '배미동', '배방읍', '법곡동', '선장면', '송악면', '신동', '신인동', '신창면', '실옥동', '염치읍', '영인면', '온양동', '온천동', '용화동', '음봉면', '읍내동', '인주면', '장존동', '점양동', '좌부동', '초사동', '탕정면', '풍기동'], ['덕산', '삽교', '고덕면', '광시면', '대술면', '대흥면', '덕산면', '봉산면', '삽교읍', '신암면', '신양면', '예산읍', '오가면', '응봉면'], ['동남구', '서북구'], ['천안역', '천안터미널', '신방통정지구', '야우리', '봉명역', '광덕면', '구룡동', '구성동', '다가동', '대흥동', '동면', '목천읍', '문화동', '병천면', '봉명동', '부성동', '북면', '사직동', '삼룡동', '성남면', '성황동', '수신면', '신방동', '신부동', '쌍용동', '안서동', '영성동', '오룡동', '용곡동', '원성동', '유량동', '청당동', '청수동', '풍세면'], ['불당동', '천안아산역', '지웰시티', '천안아산', '모다아울렛', '두정동', '백석동', '봉명동', '부대동', '불당동', '성거읍', '성성동', '성정동', '성환읍', '신당동', '쌍용동', '업성동', '와촌동', '입장면', '직산읍', '차암동'], ['남양면', '대치면', '목면', '비봉면', '운곡면', '장평면', '정산면', '청남면', '청양읍', '화성면'], ['안면도', '고남면', '근흥면', '남면', '소원면', '안면읍', '원북면', '이원면', '태안읍'], ['광천', '갈산면', '결성면', '광천읍', '구항면', '금마면', '서부면', '은하면', '장곡면', '홍동면', '홍북읍', '홍성읍']],
[['감물면', '괴산읍', '문광면', '불정면', '사리면', '소수면', '연풍면', '장연면', '청안면', '청천면', '칠성면'], ['가곡면', '단성면', '단양읍', '대강면', '매포읍', '어상천면', '영춘면', '적성면'], ['속리산', '내북면', '마로면', '보은읍', '산외면', '삼승면', '속리산면', '수한면', '장안면', '탄부면', '회남면', 
'회인면'], ['매곡면', '상촌면', '심천면', '양강면', '양산면', '영동읍', '용산면', '용화면', '추풍령면', '학산면', '황간면'], ['군북면', '군서면', '동이면', '안남면', '안내면', '옥천읍', '이원면', '청산면', '청성면'], ['충북혁신도시', '금왕', '감곡', '감곡면', '금왕읍', '대소면', '맹동면', '삼성면', '생극면', 
'소이면', '원남면', '음성읍'], ['충주호', '의림지', '제천역', '강제동', '고명동', '고암동', '교동', '금성면', '남천동', '대랑동', '덕산면', '동현동', '두학동', '명동', '명지동', '모산동', '백운면', '봉양읍', '산곡동', '서부동', '송학면', '수산면', '신동', '신백동', '신월동', '영천동', '왕암동', '의림동', '자 작동', '장락동', '중앙로', '천남동', '청전동', '청풍면', '하소동', '한수면', '화산동', '흑석동'], ['도안면', '증평읍'], ['광혜원', '광혜원면', '덕산면', '덕산읍', '문백면', '백곡면', '이월면', '진천읍', '초평면'], ['상당구', '서원구', '청원구', '흥덕구'], ['대청호', '대청댐', '청주성안길', '수암골', '상당산성', '가덕면', '금천동', '남문로', '남일면', '남주동', '낭성면', '대성동', '명암동', '문의면', '문화동', '미원면', '방서동', '북문로', '산성동', '서문동', '서운동', '석교동', '수동', '영동', '영운동', '용담동', '용암동', '용정동', '운동동', '월오동', '지북동', '탑동', '평촌동'], ['충북대', '충대중문', '개신동', '남이면', '모충동', '미평동', '분평동', '사직동', '사창동', '산남동', '성화동', '수곡동', '장성동', '장암동', '죽림동', '현도면'], ['오창', '청주대', '청주공항', '강서동', '내덕동', '내수읍', '북이면', '사천동', '오동동', '오창읍', '외남동', '외평동', '외하동', '우암동', '율량동', '정북동', '정상동', '정하동', '주성동', '주중동'], ['오송역', '오송', '충북대', '신성동', '지웰시티', '하복대', '교원대', '가경동', '강내면', '강서동', '남촌동', '내곡동', '동막동', '문암동', '복대동', '봉명동', '비하동', '상신동', '서촌동', '석곡동', '석소동', '성화개신죽림동', '송절동', '송정동', '수의동', '신대동', '신봉동', '신성동', '신전동', '신촌동', '오송읍', '옥산면', '외북동', '운천동', '원평동', '정봉동', '지동동', '평동', '향정동', '현암동', '화계동', '휴암동'], ['수안보', '충주호', '충주역', '충주주덕', '가주동', '교현동', '금가면', '금릉동', '노은면', '단월동', '달천동', '대소원면', '동량면', '목벌동', '목행동', '문화동', '봉방동', '산척면', '살미면', '성남동', '성내동', '성서동', '소태면', '수안보면', '신니면', '안림동', '앙성면', '엄정면', '연수동', '용관동', '용두동', '용산동', '용탄동', '종민동', '주덕읍', '중앙탑면', '지현동', '직동', '충의동', '충인동', '칠금동', '풍동', '호암동']]
]

# STR_URL += "%EA%B0%95%EB%82%A8%EA%B5%AC"  # 구
# STR_URL += "%20" +  ""# 동 / 역
# STR_URL += "&query=%EB%B0%98%EB%A0%A4%EB%8F%99%EB%AC%BC"  # 반려동물


class DiningCodeCrawler:

  def __init__(self):
    self.errorList = list()
    self.crawlingCategory = list()
    self.crawlingCategory.append({
        STR_NAME: 'dining_code_id',
        STR_URL: "https://www.diningcode.com/list.dc?addr=",
    })

  def StartCrawling(self):
    print(self.crawlingCategory)
    self.chrome_option = webdriver.ChromeOptions()
    self.chrome_option.add_argument('--headless')
    self.chrome_option.add_argument('--window-size=1920,1080')
    self.chrome_option.add_argument('--start-maximized')
    self.chrome_option.add_argument('--disable-gpu')
    self.chrome_option.add_argument('lang=ko=KR')

    if __name__ == '__main__':
      pool = Pool(processes=PROCESS_COUNT)
      pool.map(self.CrawlingCategory, self.crawlingCategory)
      pool.close()
      pool.join()

  def CrawlingCategory(self, categoryValue):
    crawlingName = categoryValue[STR_NAME]
    crawlingURL = categoryValue[STR_URL]

    print('Crawling Start : ' + crawlingName)

    #data
    crawlingFile = open(f'{crawlingName}.csv', 'w',
                        newline='', encoding='utf8')
    crawlingData_csvWriter = csv.writer(crawlingFile)
    # crawlingData_csvWriter.writerow([self.GetCurrentDate().strftime('%Y-%m-%d %H:%M:%S')])

    try:
      browser = webdriver.Chrome(CHROMEDRIVER_PATH, options=self.chrome_option)
      # browser.implicitly_wait(5)
      for si_idx, SI in enumerate(SI_LIST):
        tmpSiURL = categoryValue[STR_URL] + SI + "%20"
        for gu_idx, GU in enumerate(GU_LIST[si_idx]):
          tmpGuURL = tmpSiURL + GU + "%20"
          for dong_idx, DONG in enumerate(DONG_LIST[si_idx][gu_idx]):
            url = tmpGuURL + "%2B" + DONG + "&query=%EB%B0%98%EB%A0%A4%EB%8F%99%EB%AC%BC"
            print(SI + " " + GU + " "+ DONG)
            browser.get(url)
            sleep(0.1)
            # 데이터 결과 없는 경우 예외처리해야함
            try:
                browser.find_element(By.XPATH, '//div[@class="Popup-Window"]').is_displayed();
            except:
                #페이지 로딩 기다리기
                wait = WebDriverWait(browser, 10)
                wait.until(EC.element_to_be_clickable((By.ID, 'arrow')))
                # 마우스로 리스트쪽 클릭해서 포커스 두기
                # browser.find_element(By.XPATH, '//ul[@class="SearchTagList"]').click()
                # 스크롤 최하단까지 내리기 (20개씩 최대 100개 나오므로 5번 내려야함)
                browser.find_element(By.XPATH, '//div[@class="PoiList"]').click()
                liElement = browser.find_element(
                    By.XPATH, '//div[@class="sc-crXcEl jXYOev PoiListMain"]')
                browser.execute_script("arguments[0].scrollBy(0, 3800)", liElement)
                sleep(0.1)
                browser.execute_script("arguments[0].scrollBy(0, 3800)", liElement)
                sleep(0.1)
                browser.execute_script("arguments[0].scrollBy(0, 3800)", liElement)
                sleep(0.1)
                browser.execute_script("arguments[0].scrollBy(0, 3800)", liElement)
                sleep(0.1)
                browser.execute_script("arguments[0].scrollBy(0, 3800)", liElement)
                sleep(0.1)

                html = browser.find_element(
                    By.XPATH, '//div[@class="PoiList"]').get_attribute('outerHTML')
                selector = Selector(text=html)
                items = selector.xpath('//ol[@class="sc-bczRLJ dbLsXe"]/li[@class="PoiBlockContainer"]')
                for item in items:
                    itemId = item.xpath('./div[@class="PoiBlock"]').attrib['id'][5:]
                    itemName = item.xpath(f'//*[@id="block{itemId}"]/div[1]/div/div[1]/h2/text()').get().split('.')[1].strip()
                    crawlingData_csvWriter.writerow([itemId, f'{itemName}', f'{SI}', f'{GU}', f'{DONG}'])
    except Exception as e:
        print("Error - " + crawlingName + '->')
        print(e)
        self.errorList.append(crawlingName)

    crawlingFile.close()

    print('Crawling Finish : ' + crawlingName)

  def getCurrentDate(self):
    tz = timezone(TIMEZONE)
    return (datetime.now(tz))


if __name__ == '__main__':
  cralwer = DiningCodeCrawler()
  cralwer.StartCrawling()
